// vendor
import React from 'react';

const PrivacyPolicyContainer = () => (
    <div className='container'>
        <div className='content'>
            <div className='title'>
                ПОЛІТИКА КОНФІДЕНЦІЙНОСТІ
                <br />
                під час проведення конкурсу "EPAM BOT CHALLENGE",
                <br />
                який організовано ТОВ "ЕПАМ СИСТЕМЗ"
            </div>
            <div className='subTitle'>§1 Загальні положення</div>
            <ol>
                <li>
                    1. Цю Політику конфіденційності (далі "Політика")
                    затверджено ТОВ «ЕПАМ СИСТЕМЗ», зареєстрованим за адресою
                    вулиця Фізкультури 28, 03150, що є Організатором проведення
                    конкурсу (далі - «Організатор»), для цілей проведення
                    конкурсу EPAM BOT CHALLENGE, з метою інформування Учасників
                    конкурсу (далі – як «Учасники»), зокрема, в частині збору та
                    використання їх персональних даних.
                </li>
                <li>
                    2. Ця Політика визначає умови, процедури та цілі обробки
                    Персональних даних Учасників, включаючи їх збір,
                    використання, фіксацію, зберігання, обробку, внесення змін,
                    розголошення, обмін та їх передачу, а також умови захисту
                    Персональних даних Учасників.
                </li>
                <li>
                    Політикою встановлюються способи, у межах яких Учасник може
                    переглядати, оновлювати та вимагати видалення Персональних
                    даних відповідно до чинного законодавства.
                </li>
            </ol>
            <div className='subTitle'>§2 Обов’язки щодо персональних даних</div>
            <ol>
                <li>
                    1. Організатор забов’заний належно забезпечувати
                    конфіденційність Учасника шляхом дотримання всіх застосовних
                    норм законодавства про захист персональних даних, зокрема,
                    положень Закону України Про захист персональних даних
                    (Відомості Верховної Ради України (ВВР), 2010, № 34, ст.
                    481) { '{' }Із змінами, внесеними згідно із Законами № 4452-VI
                    від 23.02.2012, ВВР, 2012, № 50, ст.564 ; № 5491-VI від
                    20.11.2012, ВВР, 2013, № 51, ст.715; № 245-VII від
                    16.05.2013, ВВР, 2014, № 12, ст.178; № 383-VII від
                    03.07.2013, ВВР, 2014, № 14, ст.252; № 1170-VII від
                    27.03.2014, ВВР, 2014, № 22, ст.816; № 1261-VII від
                    13.05.2014, ВВР, 2014, № 27, ст.914; № 316-VIII від
                    09.04.2015, ВВР, 2015, № 26, ст.218; №675-VIII від
                    03.09.2015, ВВР, 2015, № 45, ст.410; № 1774-VIII від
                    06.12.2016, ВВР, 2017, № 2, ст.25{ '}' }
                </li>
                <li>
                    2. Організатор гарантує, що Персональні дані Учасників
                    обробляються справедливо, відповідно до вимог законодавства,
                    а також збираються виключно для цілей, відомих та прийнятих
                    Учасником з моменту прийняття рішення щодо участі у
                    конкурсі.
                </li>
                <li>
                    3. Організатор забов’зується вживати всіх можливих заходів,
                    необхідних для правильного та безпечного зберігання
                    Персональних даних Учасників, зібраних на виконання умов
                    цієї Політики. Вся інформація, надана Учасником,
                    зберігається на серверах Організатора або інших носіях
                    інформації з метою забезпечення належного рівня безпеки.
                </li>
                <li>
                    4. Організатор за такої можливості забов’зується вживати
                    технічних та організаційних заходів з метою захисту
                    Персональних даних від несанкціонованого або випадкового
                    доступу, знищення, зміни, блокування, копіювання,
                    розповсюдження та інших незаконних дій третіх осіб,
                    включаючи захист усіх засобів спілкування з Учасником.
                </li>
                <li>
                    5. У разі, якщо Учасник дізнається, що його дані з
                    облікового запису на платформі
                    http://epam-bot-challenge.com.ua було вкрадено або що вони
                    перебувають у власності третіх осіб, він повинен негайно
                    повідомити Організатора, для того щоб Організатор міг вжити
                    необхідних кроків. У таких випадках Організатор не може
                    гарантувати безпеку Персональних даних Учасника, а Учасник
                    погоджується, що організатор не несе відповідальності за
                    будь-яке їх використання.
                </li>
            </ol>
            <div className='subTitle'>§3 Збір Персональних даних</div>
            <ol>
                <li>
                    1. Організатор має право вимагати надання інформації про
                    Учасника та дані такого Учасника для цілей використання
                    платформи http://epam-bot-challenge.com.ua та допуску до
                    участі у Конкурсі відповідно до обсягу згоди, наданої
                    Учасником, і це може включати в себе інформацію, зокрема
                    адреси/адреси електронної пошти, IP-адресу, номер телефону,
                    інформація про посаду, місто проживання, попередній
                    професійний досвід, ідентифікаційні дані (ID) у соціальних
                    мережах, ім’я Учасника, а також пароль на платформі
                    http://epam-bot-challenge.com.ua.
                </li>
                <li>
                    2. У разі, якщо Учасник починає листування з Організатором
                    або використовує листування для будь-яких цілей контактів з
                    Організатором, Організатор має право зберігати запис
                    кореспонденції такого типу.
                </li>
            </ol>
            <div className='subTitle'>§4 Згода Учасника</div>
            <ol>
                <li>
                    1. Якщо в процесі реєстрації Учасник надає власні
                    Персональні дані, це означає, що Учасник висловив свою
                    безпосередню та остаточну згоду на обробку своїх
                    Персональних даних Організатором для цілей, зазначених у цій
                    Політиці.
                </li>
                <li>
                    2. Персональні дані збираються тільки для наступних цілей:
                    перевірка інформації, пов’язаної з Учасником; можливість
                    виправлення та ширшого використання платформи
                    http://epam-bot-challenge.com.ua; для підтримання контакту з
                    Учасником у маркетингових цілях, у тому числі у формі
                    використання адреси учасника для надсилання різноманітних
                    матеріалів, зокрема стосовно рекрутингу, подання пропозиції
                    про роботу та інформації.
                </li>
                <li>3. Учасник погоджується із цими цілями.</li>
                <li>
                    4. Учасник має право у будь-який час зв’язатися з
                    Організатором з метою отримання копії Ваших Персональних
                    даних, які зберігаються Організатором та відповідного
                    виправлення будь-яких неточностей. Учасник має право
                    вимагати, щоб його Персональні дані були вилучені,
                    виправлені, змінені або доповнені. Для того, щоб зв’язатися
                    з Адміністратором Персональних даних, Учасник повинен
                    надіслати повідомлення на адресу:
                    OrgBotChallengeUA@epam.com.
                </li>
            </ol>
            <div className='subTitle'>§5 Обробка Персональних даних</div>
            <ol>
                <li>
                    1. Персональні дані обробляються Організатором, що включає
                    їх збір, використання, об’єднання у базу, зберігання,
                    організацію, зміну, поширення, обмін та видалення.
                </li>
                <li>
                    2. Учасник погоджується, що Персональні дані, отримані
                    Організатором, можуть бути надані працівникам та
                    представникам Організатора, а також організаціям, пов’язаним
                    з Організатором у розумінні податкового законодавства.
                </li>
                <li>
                    3. Усі особи, що мають доступ до Персональних даних,
                    забов’язані дотримуватись, за виключенням випадків,
                    передбачених чинним законодавством, умови цієї Політики та
                    будуть відбиратись із належною увагою критерію довіри.
                </li>
                <li>
                    4. Учасник надає свою згоду на те, що у разі об’єднання
                    Організатора з іншою компанією у процесі реорганізації або
                    злиття, продажу, придбання, ліквідації або у будь-якому
                    іншому процесі, Персональні дані Учасників можуть бути
                    передані разом з Організатором або як його частина або
                    можуть буди продані як частина активів Організатора.
                </li>
                <li>
                    5. Учасник надає свою згоду на те, що Організатор має право
                    та обов’язок розкривати Персональні дані, якщо відповідне
                    рішення було винесено на підставі положень законодавства або
                    вимагається з боку державних органів, витребовується
                    правоохоронним органом або судом, або вимагається задля
                    захисту Персональних даних.
                </li>
            </ol>
            <div className='subTitle'>§6 Внесення Змін до Політики</div>
            <ol>
                <li>
                    Дійсною є найпізніша редакція цієї політики. Цю Політику
                    може бути змінено, вдосконалено, замінено у будь-якій формі
                    та в будь-який час без попереднього або наступного
                    повідомлення Учасника, в силу чого Учасникам рекомендується
                    знайомитися із текстом цієї Політики, щоб бути в курсі змін.
                    Будь-які зміни цієї Політики набувають чинності з моменту їх
                    публікації на веб-сайті: http://epam-bot-challenge.com.ua.
                </li>
            </ol>
            <div className='subTitle'>§7 Зв’язок з адміністратором</div>
            <ol>
                <li>
                    1. У випадку виникнення у Учасника питань, коментарів, скарг
                    або відгуків щодо цієї Політики, вони підлягають надсиланню
                    Організатору на електронну пошут:
                    OrgBotChallengeUA@epam.com.
                </li>
                <li>
                    2. Організатор може відхилити розгляд таких заяв, зокрема
                    тих, виконання яких вимагатиме непропорційних технічних
                    зусиль або загрожує конфіденційності інших Учасників.
                </li>
            </ol>
        </div>
    </div>
);

export default PrivacyPolicyContainer;
