// vendor
import React, {  Component  } from 'react';
import {  connect  } from 'react-redux';
// import classnames from 'classnames';
import {  Link  } from 'react-router-dom';
import {  CopyToClipboard  } from 'react-copy-to-clipboard';

// proj
// import {  GameElements  } from '../../components';
import {  getGameConnectionString, getJavaClient  } from '../../utils';
import {  book  } from '../../routes';
import Rules from '../../styles/images/icons/rules.svg';

// own
import Styles from './styles.module.css';

const BOARD_EXAMPLE = `
board=☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼ # # # #♥# # # &
#☼☼♥☼♥☼♥☼#☼ ☼ ☼ ☼ ☼♥☼ ☼ ☼#☼#☼♥☼#☼#☼☼#♥♥ ♥# # #♥ # ♥# ☼☼ ☼ ☼#☼ ☼♥☼ ☼
☼#☼ ☼ ☼ ☼ ☼&☼ ☼ ☼ ☼☼ ♥ # # ☼☼ ☼ ☼ ☼ ☼♥☼ ☼ ☼♥☼#☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼☼#
# # ☺& 2 # # #☼☼#☼♥☼ ☼#☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼#☼ ☼ ☼ ☼☼#  # ♥# # ♥ # ☼☼
☼ ☼#☼#☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼#☼ ☼☼ #♥ # # ☼☼ ☼ ☼ ☼ ☼♥☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼
☼ ☼#☼☼ ## # # # # ♥ ☼☼ ☼ ☼♥☼ ☼ ☼#☼ ☼#☼ ☼ ☼♥☼ ☼ ☼ ☼ ☼ ☼☼ #♥ #
## # ###☼☼ ☼ ☼ ☼#☼ ☼ ☼#☼ ☼ ☼#☼#☼&☼ ☼ ☼ ☼ ☼☼ # # ♣# # ♥ ☼☼ ☼ ☼
☼♥☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼#☼ ☼☼ ## ## ♥ # #☼☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼
☼☼ &### ##☼☼ ☼ ☼ ☼ ☼ ☼ ☼#☼ ☼#☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼☼ ♥ ##
☼☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼♥☼#☼ ☼ ☼ ☼☼ ## &# # ☼☼ ☼ ☼ ☼#☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼#☼
☼ ☼ ☼ ☼☼ # # # # & ☼☼♥☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼#☼#☼ ☼☼ # ##
& ☼☼ ☼ ☼ ☼ ☼ ☼#☼ ☼ ☼ ☼ ☼ ☼ ☼#☼ ☼#☼ ☼☼ # # & # #
☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼
`;
const BOARD_EXAMPLE_2 = `
☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼
☼ #   # #  #♥#  #  #  &        #☼
☼♥☼♥☼♥☼#☼ ☼ ☼ ☼ ☼♥☼ ☼ ☼#☼#☼♥☼#☼#☼
☼#♥♥  ♥#   # #♥   # ♥#      	☼
☼ ☼ ☼#☼ ☼♥☼ ☼ ☼#☼ ☼ ☼ ☼ ☼&☼ ☼ ☼ ☼
☼ 	♥      	# #        	☼
☼ ☼ ☼ ☼ ☼♥☼ ☼ ☼♥☼#☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼
☼#   	# #   	☺& 2  #  #  #☼
☼#☼♥☼ ☼#☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼#☼ ☼ ☼ ☼
☼#  # ♥#      	     # ♥   #  ☼
☼ ☼ ☼#☼#☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼#☼ ☼
☼   #♥ #  	#             	☼
☼ ☼ ☼ ☼ ☼♥☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼#☼
☼ 	## # 	#   # #   ♥  	☼
☼ ☼ ☼♥☼ ☼ ☼#☼ ☼#☼ ☼ ☼♥☼ ☼ ☼ ☼ ☼ ☼
☼   	#♥   	#      ## # ###☼
☼ ☼ ☼ ☼#☼ ☼ ☼#☼ ☼ ☼#☼#☼&☼ ☼ ☼ ☼ ☼
☼       #   	#    ♣# # 	♥ ☼
☼ ☼ ☼ ☼♥☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼#☼ ☼
☼    	## ## ♥         	# #☼
☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼
☼                   &	###  ##☼
☼ ☼ ☼ ☼ ☼ ☼ ☼#☼ ☼#☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼
☼               	♥ ##    	☼
☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼♥☼#☼ ☼ ☼ ☼
☼ 	##     	&#     	#   ☼
☼ ☼ ☼ ☼#☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼#☼ ☼ ☼ ☼ ☼
☼   #   #         # 	# & 	☼
☼♥☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼ ☼#☼#☼ ☼
☼  #                	##   &  ☼
☼ ☼ ☼ ☼ ☼ ☼#☼ ☼ ☼ ☼ ☼ ☼ ☼#☼ ☼#☼ ☼
☼ #	# &    	#       # 	☼
☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼☼
`;

const {  boardExample, mask, highligte, highligteNotes  } = Styles;

class RulesContainer extends Component {
    render() {
        const {  server, code, id  } = this.props;
        const loggedIn = [ server, code, id ].every(Boolean);
        const connectionUrl = loggedIn
            ? getGameConnectionString(server, code, id)
            : void 0;

        const clientLink = loggedIn ? (
            <a href={ getJavaClient(server) }>Clients</a>
        ) :
            'Clients'

        return (
            <div className='container'>
                <div className={ mask }>Bot Challenge - як грати?</div>
                <div className='content'>
                    <h2 className='title'>У чому суть гри?</h2>
                    <p>
                        Треба написати свого бота для героя, який обіграє інших
                        ботів за очками. Всі грають на одному полі. Герой може
                        пересуватися по відкрити додаткові клітинки в усі чотири
                        сторони.
                    </p>
                    <p>
                        Герой може також поставити бомбу. Бомба вибухне через 5
                        тиків (секунд). Вибуховою хвилею бомби можна зачепити
                        мешканців поля. Всі, хто був зачеплений - зникає.
                        Підірватися можна і на своїй, і на чужій бомбі.
                    </p>
                    <p>
                        На своєму шляху герой може зустріти мітчопера - червону
                        повітряну кульку, що знищує на своєму шляху всіх
                        бомберменов.
                    </p>
                    <p>
                        Кожен зруйнований об'єкт на полі (бомбермен, мітчопер,
                        що руйнуються стінки) в цей же час же відновлюється в
                        іншому місці. Якщо постраждав бомбермен, йому
                        зараховуються штрафні бали -50 *.
                    </p>
                    <p>
                        Бомбермен, від бомби якого сталися руйнування на мапі
                        отримає бонусні бали: за зруйновану стінку + 10 *, за
                        мітчопера + 100 *, за іншого бомбермена + 1000 *
                    </p>
                    <p>*точну суму балів треба уточнити у ведучого</p>
                    <p>
                        Бали сумуються. Перемагає гравець з найбільшою кількістю
                        балів (до обумовленого часу).
                    </p>
                    <h2 className='title'>Як почати?</h2>
                    <div className='subTitle'>
                        Завантажте Клієнти гри для створення Бота: { clientLink }
                        { !loggedIn &&
                            '(посилання стануть доступні після входу на сайт)' }
                    </div>
                    <p>
                        Пам'ятайте: у процесі написання Бота Вам необхідно
                        піклуватись тільки про логіку переміщень вашого Бота.
                        Всі необхідні допоміжні речі вже зроблені за Вас.
                    </p>
                    <p>
                        Зареєструйтеся скориставшися формою реєстрації Нового
                        гравця. Запам'ятайте зазначені адресу електронної пошти
                        і пароль - вони знадобляться Вам у майбутньому для
                        авторизації на сайті.
                    </p>
                    <p>
                        Далі необхідно приєднатися з коду до сервера через
                        вебсокети.
                    </p>
                    <div className='subTitle'>
                        Адреса для підключення до гри на сервері:
                    </div>
                    <div className={ highligte }>
                        { loggedIn ? (
                            <>
                                { connectionUrl }
                                <CopyToClipboard text={ connectionUrl }>
                                    <img
                                        className={ Styles.copyConnection }
                                        src={ Rules }
                                        alt='Скопіювати адрес'
                                    />
                                </CopyToClipboard>
                            </>
                        ) : (
                            <Link to={ book.login }>
                                Потрібно увійти в систему для отримання адресу
                            </Link>
                        ) }
                    </div>
                    <div className={ highligteNotes }>
                        Тут 'user' - id гравця, a 'code' - твій security token,
                        його ти можеш отримати з адресного рядка браузера після
                        реєстрації/логіна.
                    </div>
                    <p>
                        Після підключення клієнт буде регулярно (кожну секунду)
                        отримувати рядок символів із закодованим станом поля.
                        Формат такий.
                        <br />
                    </p>
                    <p>{ '<Pre> ^ board = (. *) $' }</p>
                    <p>
                        {
                            '<P> за допомогою цього regexp можна викусити рядок дошки.'
                        }
                    </p>
                    <div className='subTitle'>
                        Ось приклад рядка від сервера:
                    </div>
                    <div className={ highligte }>
                        <pre className={ boardExample }>{ BOARD_EXAMPLE }</pre>
                    </div>
                    <p>
                        { ' ' }
                        Довжина рядка дорівнює площі поля. Якщо вставити символ
                        розриву рядків кожні sqrt (length (string)) символів, то
                        вийде читабельним зображення поля.
                    </p>
                    <div className={ highligte }>
                        <pre className={ boardExample }>{ BOARD_EXAMPLE_2 }</pre>
                    </div>
                    <p>
                        Перший символ рядка відповідає осередку розташованої в
                        лівому верхньому кутку і має координату [0,32]. У цьому
                        прикладі – позиція бомбермена (символ'☺') - [19, 25].
                        Лівий нижній кут має координату [0, 0].
                    </p>
                    <p>Розшифрування символів на малюнку нижче.</p>
                    <br />
                    <p>Твій бомпермен:</p>
                    <p>BOMBERMAN('☺'), // так виглядає мій бомбер</p>
                    <p>
                        BOMB_BOMBERMAN('☻'), // так виглядає мій бомбер, якщо
                        він сидить на бомбі
                    </p>
                    <p>
                        DEAD_BOMBERMAN('Ѡ'), // ой! твій бомбер помер. Не
                        хвилюйся, він з'явиться через секунду десь на полі, але
                        цілком ймовірно за це ти отримаєш штрафні бали.
                    </p>
                    <br />
                    <p>Бомпермени противників:</p>
                    <p>
                        OTHER_BOMBERMAN ('♥'), // а так виглядає бомбер
                        противника
                    </p>
                    <p>
                        OTHER_BOMB_BOMBERMAN ('♠'), // так, якщо бомбер
                        противника сидить на бомбі
                    </p>
                    <p>
                        OTHER_DEAD_BOMBERMAN ('♣'), // так, якщо бомбер
                        противника підірвався. Якщо це ти його підірвав - ти
                        отримаєш бонусні бали.
                    </p>
                    <br />
                    <p>Бомби:</p>
                    <p>
                        BOMB_TIMER_5 ('5'), // після того як бомбер поставить
                        бомбу таймер вкючая (всього 5 тиків)
                    </p>
                    <p>BOMB_TIMER_4 ('4'), // ця бомба вибухне через 4 тіка</p>
                    <p>BOMB_TIMER_3 ('3'), // ця - через 3</p>
                    <p>BOMB_TIMER_2 ('2'), // два</p>
                    <p>BOMB_TIMER_1 ('1'), // один</p>
                    <p>
                        BOOM ('҉'), // Бам! Це те, як бомба вибухає. При цьому
                        все, що може бути зруйновано – зруйнується
                    </p>
                    <br />
                    <p>Стіни:</p>
                    <p>
                        WALL ('☼'), // неруйнівні стіни - їм вибухи бомб не
                        страшні
                    </p>
                    <p>
                        DESTROYABLE_WALL ('#'), // а ця стінка може бути
                        зруйнована
                    </p>
                    <p>
                        DESTROYED_WALL ('H'), // це як зруйнована стіна
                        виглядає, вона пропаде в наступну секунду якщо це ти
                        зробив - ти отримаєш бонусні бали
                    </p>
                    <br />
                    <p>Мітчопери:</p>
                    <p>
                        MEAT_CHOPPER ('&'), // цей малий бігає по полю в
                        довільному порядку, якщо він дотроентся до бомбера - той
                        помре краще б тобі знищити цей шматок .... м'яса, за це
                        ти отримаєш бонусні бали
                    </p>
                    <p>
                        DEAD_MEAT_CHOPPER ('x'), // це мітчопер, який вибухнув
                    </p>
                    <br />
                    <p>Перки:</p>
                    <p>
                        Перки випадають на місці знищенної стіни з певною верогідністю (20% за замовчуванням).
                        <br/>
                        Сила ефекту, таймаути, верогідність випадання перків можуть бути знищені адміністратором гри.
                        <br/>
                        Тут вказані значення за замовчуванням. Дія перку зникає по таймауту (10 тіків), якщо не вказано інакше в описі перку.
                        <br/>
                        Якщо перк ніхто не підібрав, він зникає з поля після 5 тіків.
                    </p>
                    <p>
                        BOMB_BLAST_RADIUS_INCREASE('+'), // Збільшує радіус вибуху бомби (+2 до поточного).
                                                         // Діє лише для нових бомб.
                    </p>
                    <p>
                        BOMB_COUNT_INCREASE('c'), // збільшує кількість доступних гравцю бомбер (+3 до поточного рівня).
                    </p>
                    <p>
                        BOMB_IMMUNE('i'), // Дає імунітет до вибухів бомб (навіть чужіх).
                    </p>
                    <p>
                        BOMB_REMOTE_CONTROL('r'), // Дистанційне керування детонатором. Бомба вибухає при повторній дії. 3 детонатора.
                    </p>
                    <p>
                        void NONE (''); // вільна секція, куди ти можеш
                        направити бомбера
                    </p>
                    { /* <div className='subTitle'>UI зі спрайтів:</div>
                    <GameElements /> */ }
                    <p>
                        Гра покрокова, кожну секунду сервер посилає твоєму
                        клієнту (боту) стан оновленого поля на поточний момент і
                        чекає на відповідь команди герою. За наступну секунду
                        гравець повинен встигнути дати команду герою. Якщо не
                        встиг - герой стоїть на місці.
                    </p>
                    <p>
                        Команд декілька: UP, DOWN, LEFT, RIGHT - призводять до
                        руху героя в заданому напрямку на 1 клітину; ACT -
                        залишити бомбу на місці героя. Команди руху можна
                        комбінувати з командою ACT, розділяючи їх через кому.
                        Порядок (LEFT, ACT) або (ACT, LEFT) - має значення, або
                        рухаємося вліво і там ставимо бомбу, або ставимо бомбу а
                        потім біжимо вліво. Якщо гравець буде використовувати
                        тільки одну команду ACT, то бомба буде встановлена під
                        героєм без його переміщення на полі.
                    </p>
                    <p>
                        Завдання - написати websocket клієнта, який підключиться
                        до сервера. Потім змусити героя слухатися команди. Таким
                        чином, гравець підготується до основної грі. Основна
                        мета - вести осмислену гру і перемогти, набравши
                        найбільшу кількість балів.
                    </p>
                </div>
            </div>
        );
    }
}

const mapStateToProps = state => ({
    id:     state.auth.id,
    server: state.auth.server,
    code:   state.auth.code,
});

export default connect(
    mapStateToProps,
    null,
)(RulesContainer);
