// vendor
import React from 'react';

// proj
import Rules from '../../styles/images/icons/rules.svg';

const PrivacyPolicyContainer = () => (
    <div className='container'>
        <div className='content'>
            <div className='title'>
                ПРАВИЛА КОНКУРСУ "EPAM BOT CHALLENGE",
                <br />
                організованого ТОВ "ЕПАМ СИСТЕМЗ"
            </div>
            <div className='subTitle'>§ 1 Загальна інформація</div>
            <ol>
                <li>
                    1. Ці правила конкурсу включають у себе правила та умови
                    участі в конкурсі EPAM BOT CHALLENGE (тут і далі - Конкурс).
                </li>
                <li>
                    2. Організатором конкурсу є компанія ТОВ «ЕПАМ СИСТЕМЗ»,
                    розташована за адресою м. Київ, вул. Фізкультури 28, 03150
                    Київ (тут і далі - Організатор).
                </li>
                <li>
                    3. Належне проведення конкурсу буде контролюватися
                    представниками, призначеними Організатором, відповідальними
                    щодо технічних і основних питань. У разі будь-яких запитань
                    стосовно Конкурсу з Організатором можна зв’язатися за
                    електронною адресою: OrgBotChallengeUA@epam.com.
                </li>
                <li>4. Конкурс проходитиме на території України.</li>
                <li>
                    5. Конкурс буде проводитися в онлайн-форматі на веб-сайті{ ' ' }
                    <a href={ process.env.REACT_APP_EVENT_LINK }>
                        { process.env.REACT_APP_EVENT_LINK }
                    </a>
                    .
                </li>
            </ol>
            <div className='subTitle'>§ 2 Правила конкурсу</div>
            <ol>
                <li>
                    1. Конкурс відкритий для будь-якої фізичної особи з повною
                    цивільною правоздатністю і дієздатністю, за умови, що вона
                    відповідає наступним умовам:
                    <ol>
                        <li>1) вік - не молодше 18 років;</li>
                        <li>
                            2) володіє чи має змогу користуватися комп'ютером чи
                            ноутбуком з доступом до мережі Інтернет. Учасник
                            оплачує доступ в мережу Інтернет самостійно;
                        </li>
                        <li>
                            3) зареєструється на платформі{ ' ' }
                            <a href={ process.env.REACT_APP_EVENT_LINK }>
                                { process.env.REACT_APP_EVENT_LINK }
                            </a>{ ' ' }
                            шляхом заповнення анкети;
                        </li>
                        <li>
                            4) ознайомлена з Правилами конкурсу і Політикою
                            конфіденційності та погодилася з Політикою
                            конфіденційності у відповідному розділі
                            онлайн-реєстрації на Конкурс (згаданої у підпункті 3
                            пункту 1 розділу 2 цих Правил);
                        </li>
                    </ol>
                </li>
                <li>
                    2. Особа, яка відповідає вимогам викладеним у п.1 розділу 2
                    Правил Конкурсу та бажає прийняти участь у Конкурсі, шляхом
                    виконання необхідних дій, стає учасником Конкурсу (тут і
                    далі - Учасник).
                </li>
                <li>
                    3. У Конкурсі не мають права приймати участь співпрацівники
                    Організатора, особи, найняті ним на основі договору
                    цивільно-правового характеру та члени родин осіб, які
                    перебувають з Організатором в трудових та/або
                    цивільно-правових відносинах;
                </li>
                <li>
                    4. Організатор має право перевіряти та видаляти заявки на
                    участь, що не відповідають підпунктам 1-4 пункту 1 розділу 2
                    Правил Конкурсу. Організатор залишає за собою право
                    видалення з платформи{ ' ' }
                    <a href={ process.env.REACT_APP_EVENT_LINK }>
                        { process.env.REACT_APP_EVENT_LINK }
                    </a>{ ' ' }
                    тих Учасників, які порушують правила участі у Конкурсі,
                    особливо положення, які захищають конфіденційність третіх
                    сторін.
                </li>
                <li>
                    5. Погоджуючись з Політикою конфіденційності, Учасник дає
                    згоду на обробку своїх персональних даних, переданих
                    Організаторам Конкурсу.
                </li>
                <li>
                    6. Учасник також дає згоду на публікацію його імені
                    (вказаного при реєстрації на Конкурс) в турнірній таблиці
                    Конкурсу й анонсах результатів Конкурсу в соціальних
                    мережах.
                </li>
                <li>
                    7. У Конкурсі використовуються мови програмування JavaScript
                    і Java, але участь не вимагає від Учасника експертних
                    навичок володіння даними мовами програмування. Організатор
                    надає додаткові матеріали: WebSocket клиєнти (заготовки для
                    ботів) для мов Java і JavaScript, які можна завантажити з
                    платформи{ ' ' }
                    <a href={ process.env.REACT_APP_EVENT_LINK }>
                        { process.env.REACT_APP_EVENT_LINK }
                    </a>
                    .
                </li>
                <li>8. Кількість Учасників Конкурсу необмежена.</li>
            </ol>
            <div className='subTitle'>
                § 3 Проведення Конкурсу, призи та умови їх отримання
            </div>
            <ol>
                <li>
                    1. Конкурс проводиться в онлайн-форматі з 21.01.2019 по
                    07.02.2019 року.
                </li>
                <li>
                    2. Конкурс базується на комбінації стратегічних навичок
                    програмування та елементів штучного інтелекту. Формат
                    Конкурсу - турнір ботів у формі різновиду гри Змійка.
                </li>
                <li>
                    3. Завдання кожного учасника полягає у створенні розумного
                    бота, який отримає найбільшу кількість Балів в один з
                    Ігрових днів, потрапить до Фіналу і обіграє ботів інших
                    Учасників у фіналі за кількістю Балів.
                </li>
                <li>
                    4. Усі Боти, що будуть створені Учасниками, будуть змагатися
                    з ботами інших Учасників у численних Матчах. В рамках
                    Конкурсу кожен гравець буде змагатися проти інших Учасників.
                </li>
                <li>
                    5. Змагання проходитимуть у Кімнатах по декілька Участників
                    на одному Полі.
                </li>
                <li>
                    6. Кожна Кімната грає декалька Раудів. Один Раунд триватиме
                    доти, доки не залишиться тільки одна Змійка на Полі.
                </li>
                <li>
                    7. Після серії із кількох Раудів у одній Кімнаті, Кімнату
                    Участникові буде змінено автоматично на іншу на Кімнату із
                    іншим складом Участників.
                </li>
                <li>8. Вигляд Поля може бути змінено від Матчу до Матчу.</li>
                <li>
                    9. На ігровому Полі присутні як Учасники, так і різноманітні
                    ігрові Елементи (перешкоди, бонуси тощо). За взаємодію з
                    цими Елементами можуть нараховуватись як бонусні, так і
                    штрафні Бали (детальніше на Порталі{ ' ' }
                    <a href={ process.env.REACT_APP_EVENT_LINK }>
                        { process.env.REACT_APP_EVENT_LINK }
                    </a>{ ' ' }
                    у розділі “Правила гри”).
                </li>
                <li>
                    10. За один Iгровий День з 9:00 до 19:00 кожен Участник
                    матиме можливість заробити певну кількість Балів, які
                    сумуються впродовж всіх Матчів/Раудів за цей проміжок часу.
                </li>
                <li>
                    11. Переможцями Ігрового Дня вважаються 10 Ботів Участників
                    за результатами всіх Раундів Ігрового Дня на день та годину
                    закриття Ігового Дня.
                </li>
                <li>
                    12. Тільки Участники, які набрали більше 0 Балів протягом
                    Ігрового Дня можуть стати Переможцями Ігрового Дня.
                </li>
                <li>
                    13. Якщо на останнє місце (10-те) будуть претендувати більше
                    ніж один Участник (отримано однакову кількість Балів) - всі
                    вони обираються Переможцями цього Iгрового Дня.
                </li>
                <li>
                    14. Переможці кожного дня автоматично попадають до Фіналу,
                    який відбудеться останнього дня Конкурсу (07.02.2019).
                </li>
                <li>
                    15. Участники, що не потрапили до списку Переможців у
                    будь-який день Конкурсу до Фіналу, мають можливість
                    вдосконалити свого Бота і спробувати потрапити до списку
                    Фіналістів у будь-який інший Ігровий День до Фіналу, тобто
                    до 06.02.2019 включно.
                </li>
                <li>
                    16. Протягом Конкурсу Учасник має змогу вдосконалювати код.
                    Це можливо у будь-який час до, під час, та після кожного
                    Раунду.
                </li>
                <li>
                    17. Слід пам’ятати, що якщо Бот під час Раунду не був
                    активований (його вдосконалюють, є наявні проблеми із
                    зв’язком тощо) - сервер виконує дію по замовчуванню, що
                    призведе до програшу в поточному Раудні.
                </li>
                <li>
                    18. Сервери Конкурсу працюватимуть 24/7, що дає змогу
                    вдосконалювати Бота у будь-який час. Але Організатор лишає
                    за собою право перезавантажувати сервери в час з 20:00 до
                    8:00 без попередньої нотифікації Участників.
                </li>
                <li>
                    19. Змагання буде візуалізоване - раунди між усіма Ботами
                    будуть транслюватися у форматі онлайн-стріму на Сайті{ ' ' }
                    <a href={ process.env.REACT_APP_EVENT_LINK }>
                        { process.env.REACT_APP_EVENT_LINK }
                    </a>{ ' ' }
                    у розділі “Трансляція” де є можливість перейти до будь-якої
                    Кімнати. Подивитися результати по всіх Кімнатах серед всіх
                    Учасників на поточний момент кожного Ігрового Дня можна на
                    сайті у розділі “Турнірна таблиця”.
                </li>
                <li>
                    20. Окрім електронної адреси OrgBotChallengeUA@epam.com для
                    спілкування між Участниками та Організатором буде створено
                    Канал у додатку Slack, приєднатися до якого можна за{ ' ' }
                    <a href={ process.env.REACT_APP_JOIN_CHAT_LINK }>
                        посиланням <img src={ Rules } alt='rules' />
                    </a>
                    .
                </li>
                <li>
                    21. Фінал Конкурсу проходитиме подібно до Ігрового Дня із
                    такими відмінностями:
                    <ol>
                        <li>
                            21.1 Фінал Конкурсу проходитиме останнього дня
                            Конкурсу 07.02.2019
                        </li>
                        <li>
                            21.2 У Фіналі братимуть участь тільки Переможці
                            кожного Ігрового Дня Конкурсу у період з 21.02.2019
                            по 06.02.2019.
                        </li>
                        <li>
                            21.3 Перша частина Фіналу триватиме 07.02.2019 з
                            9:00 до 17:00, після чого буде обрано 10 кращих
                            Ботів Участників за результатами всіх Раундів цієї
                            частини Фіналу - Суперфіналісти.
                        </li>
                        <li>
                            21.4 Тільки Участники, які набрали більше 0 Балів у
                            Фіналі до 17:00 години можуть стати
                            Суперфіналістами.
                        </li>
                        <li>
                            21.5 Якщо на останнє місце (10-те) будуть
                            претендувати більше ніж один Учасник (отримано
                            однакову кількість Балів) - всі вони обираються
                            Суперфіналістами.
                        </li>
                        <li>
                            21.6 Суперфінал триватиме 07.02.2019 з 18:00 до
                            19:00 у формі серії Раундів серед Суперфіналістів.
                        </li>
                        <li>
                            21.7 Суперфінал триватиме рівно одну годину й о
                            19:00 гру буде зупинено.
                        </li>
                        <li>
                            21.8 Трьох переможців Суперфіналу буде визначено за
                            кількістю зароблених балів.
                        </li>
                    </ol>
                </li>
                <li>
                    22. У разі, якщо два чи більше учасників займуть перше,
                    друге або третє місце, перемога буде віддана тому Учаснику,
                    який здобув найбільшу кількість перемог протягом
                    попереднього періоду Конкурсу за всі Игрові Дні до старту
                    Фіналу, тобто до 06.02.2019 включно.
                </li>
                <li>
                    23. Призи отримають Учасники, які посядуть перше, друге та
                    третє місця в турнірній таблиці Конкурсу під час фінального
                    раунду в останній день Конкурсу. Призи є матеріальними:
                    ігрова консоль Sony PlayStation 4 SLIM за перше місце, Sony
                    PSP E1008 Street за друге місце; Sony PlayStation Classic за
                    третє місце. Оскільки отримувачами подарунків є фізичні
                    особи, вартість таких подарунків, з урахуванням пп. 165.1.39
                    п.165.1 ст.165 ПКУ, є об’єктом оподаткування податком на
                    доходи фізичних осіб і військовим збором та оподатковується
                    на загальних підставах. Сплату такого податку бере на себе
                    Організатор. Організатор надає призи переможцям протягом 3
                    місяців з моменту оголошення переможців.
                </li>
                <li>
                    24. Передача Призів переможцям є обов’язком виключно
                    Організатора Конкурсу. Призи можуть бути отримані в офісі
                    Організатора за адресою м. Київ, вул. Кудряшова 14Б. Також
                    можливо відправити призи поштою на території України чи
                    отримати в офісах Організатора за адресами: м. Львів, вул.
                    Олени Степанівни 45, м. Харків, вул. 23 Серпня 33Г, м.
                    Вінниця, вул. Оводова 51 та м. Дніпро, вул. Володимира
                    Мономаха 17А. Для отримання призу Учасник повинен зв’язатися
                    з Організатором за електронною адресою:
                    OrgBotChallengeUA@epam.com. При отриманні Призу потрібно
                    мати з собою паспорт та ІПН для ідентифікації особи. Для
                    отримання Призу потрібно буде підписати Протокол про
                    вручення подарунка і надати копію паспорта громадянина
                    України.
                </li>
                <li>
                    25. Призи, що не будуть затребувані протягом 30 днів із дня
                    закінчення Конкурсу, переходять у власність Організатора
                    Конкурсу, який має можливість скасувати приз а Учасник, який
                    не отримав приз, не має права на подання будь-яких скарг
                    та/або претензій з цього приводу. Організатор не несе
                    відповідальності за неможливість Учасника отримати приз.
                </li>
                <li>
                    26. Організатор не несе відповідальність за будь-які
                    матеріальні чи нематеріальні збитки, нанесені Учаснику у
                    зв’язку з його участю в Конкурсі, результатом участі у
                    Конкурсі чи у зв’язку з присудженням чи не присудженням
                    призу.
                </li>
            </ol>
            <div className='subTitle'>§ 4 Право на використання зображень</div>
            <ol>
                <li>
                    1. Організатор має право на вільне використання зображень
                    Учасників, у вигляді фотографій чи аудіо-відео записів, з
                    метою промоції описаного вище Конкурсу, без жодних часових
                    та територіальних обмежень, на що Учасник надає безвідкличну
                    і безумовну згоду. Ця згода включає у себе можливість
                    використання зображень у таких формах:
                    <ol>
                        <li>
                            1) запис та відтворення за допомогою будь-яких
                            відомих технологій, розповсюдження у будь-якій
                            формі;
                        </li>
                        <li>
                            2) надання доступу організаціям, обраним
                            Організатором Конкурсу, оригіналів чи копій носіїв,
                            на які записані зображення з метою промоції
                            організації як спонсора/партнера Події, в рамках
                            якої було організовано Конкурс.
                        </li>
                        <li>
                            3) надання доступу до комп’ютерної пам’яті та/або
                            мультимедійної мережі та/або до мережі Інтернет;
                        </li>
                        <li>
                            4) відтворення шляхом запису зображень, розміщених у
                            будь-який спосіб та на будь-яких носіях;
                        </li>
                        <li>
                            5) публічна демонстрація, презентація,
                            реконструкція, транслювання та ре-транслювання,
                            також як публічний доступ будь-якій особі у спосіб
                            та час, за її власним вибором;
                        </li>
                        <li>
                            6) розміщення та публікація у газетах, на
                            веб-сайтах, постерах та білбордах, у соціальних
                            мережах, форумах та інших медіа та інформаційних
                            носіях, промо-матеріалах, маркетингових матеріалах
                            тощо (розсилки, ліфлети, тощо)
                        </li>
                        <li>7) Телевізійні та радіо-трансляції.</li>
                    </ol>
                </li>
                <li>
                    2. Організатор залишає за собою право надавати доступ до
                    використання таких зображень Учасника пов’язаним особам.
                </li>
            </ol>
            <div className='subTitle'>§ 5 Обробка персональних даних</div>
            <ol>
                <li>
                    Згідно з Законом України «Про захист персональних даних»,
                    Організатор заявляє, що:
                    <ol>
                        <li>
                            1) адміністратор персональних даних Учасників є
                            задіяним у Конкурсі;
                        </li>
                        <li>
                            2) дані Учасників будуть оброблені згідно із цілями,
                            зазначеними в Політиці конфіденційності;
                        </li>
                        <li>
                            3) учасники мають право доступу до власних
                            персональних даних та право вносити у них зміни
                            згідно з умовами, зазначеними в Законі України «Про
                            захист персональних даних».
                        </li>
                    </ol>
                </li>
            </ol>
            <div className='subTitle'>§6 Передача авторського права</div>
            <ol>
                <li>
                    1. Якщо у результаті Конкурсу буде створено проект, який є
                    об’єктом авторського права, майнові права на нього будуть
                    передані Організатору, якщо він заявить про таке бажання. У
                    цьому випадку Учасник зобов’язаний укласти з Організатором
                    авторський договір про передачу таких прав.
                </li>
                <li>
                    2. Учасник не має права вимагати від Організатора
                    компенсації за передачу такого авторського права. Учасник
                    погоджується, що він не матиме ніяких претензій щодо
                    безоплатної передачі майнових авторських прав.
                </li>
                <li>
                    3. Для того, щоб передати майнові авторські права, необхідно
                    укласти договір у письмовій формі, між Учасником і
                    Організатором, в якому сторони погодяться про передачу
                    майнових авторських прав.
                </li>
                <li>
                    4. Якщо такий договір буде укладено, Учасник зобов'язується
                    передати Організатору майнові авторські права на кожен твір,
                    створений в результаті участі в конкурсі, (якщо робота буде
                    об’єктом авторського права), у таких сферах:
                    <ol>
                        <li>
                            1) В області запису та відтворення - виготовлення та
                            запис примірників твору з використанням будь-якої
                            техніки та у будь-який спосіб включаючи друк,
                            копіювально-розмножувальні роботи, магнітний запис і
                            цифрову техніку; нанесення на всі носії незалежно
                            від системи, формату і стандарту, зокрема, на
                            аудіовізуальні носії, відеокасети, власний
                            комп'ютер, DVD, магнітну стрічку, фотоплівку,
                            аналогові плати, CD, VCD, CD-ROM для MP3-файлів,
                            флеш-диски; відтворення за допомогою будь-яких
                            засобів, зокрема, чутливих до світла, магнітних,
                            аудіовізуальних, цифрових (будь-якого типу),
                            оптичних, друку в будь-якій формі та комп'ютерного
                            запису;
                        </li>
                        <li>
                            2) в області торгівлі - випуск у продаж оригіналів
                            або копій, позика або оренда оригіналів або копій;
                        </li>
                        <li>
                            3) Розповсюдження твору способами, не зазначеними у
                            підпункті 2 пункту 4 розділу 6 цих Правил - публічне
                            виконання, показ, трансляція і ретрансляція, а також
                            публічний доступ таким чином, що кожен може мати
                            доступ до нього за часом і місцем знаходження на їх
                            вибір; використання повністю або частково в мережі
                            он-лайн, в тому числі доступ до комп'ютерної пам'яті
                            або поширення у мережі засобів масової інформації, в
                            тому числі в мережі Інтернет, або надання доступу у
                            цифровому вигляді для ефірного мовлення в
                            необмеженій кількості разів;
                        </li>
                        <li>
                            4) обмін, розповсюдження твору або його частини у
                            формах публічного використання, крім зазначених
                            вище: використання для реклами, просування,
                            маркетингу, інформаційної та комерційної діяльності,
                            демонстрації, публікації (в тому числі в мережі
                            Інтернет, а також за допомогою використання
                            будь-яких телекомунікаційних послуг).
                        </li>
                        <li>
                            5) Для будь-яких випадків, не визначених в розділі 6
                            Правил Конкурсу, застосовуються положення договору
                            (та правила, встановлені у такому договорі).
                        </li>
                    </ol>
                </li>
            </ol>
            <div className='subTitle'>§7 Заключні положення</div>
            <ol>
                <li>
                    1. Правила Конкурсу та Політика Конфіденційності розміщені
                    на веб-сайті{ ' ' }
                    <a href={ process.env.REACT_APP_EVENT_LINK }>
                        { process.env.REACT_APP_EVENT_LINK }
                    </a>
                    .
                </li>
                <li>
                    2. Організатор Конкурсу залишає за собою право скасувати
                    Конкурс у будь-який час.
                </li>
                <li>
                    3. Організатор Конкурсу залишає за собою право змінити ці
                    правила Конкурсу в будь-який час до початку проведення
                    Конкурсу.
                </li>
                <li>
                    4. Питання, що не врегульовані правилами Конкурсу,
                    регулюються Цивільним кодексом України, Податковим кодексом
                    України та іншими законами України.
                </li>
                <li>
                    5. Організатор Конкурсу має право вимагати від кожного
                    Учасника надання даних, необхідних для належного проведення
                    Конкурсу. Надання таких даних є добровільним, але водночас є
                    необхідною умовою для участі в Конкурсі.
                </li>
            </ol>
        </div>
    </div>
);

export default PrivacyPolicyContainer;
