// vendor
import React from 'react';

const PrivacyPolicyContainer = () => (
    <div className='container'>
        <div className='content'>
            <div className='title'>
                ПОЛІТИКА КОНФІДЕНЦІЙНОСТІ ТА ЗГОДА НА ОБРОБКУ ДАНИХ
            </div>
            <p>
                Ця Політика конфіденційності персональних даних Відвідувачів
                сайту (далі – «Політика») прийнята ТОВ «ЕПАМ РІШЕННЯ»/, юридична
                та поштова адреса: Україна, г. Київ, вул. Фізкультури 28, 03150
                (далі — «Компанія»), і діє у відношенні персональних даних, які
                Компанія може отримати відносно Відвідувача сайту
                http://epam-bot-challenge.com.ua (далі – «Сайт»), з будь-якого
                пристрою і при комунікації з Компанією в будь-якій формі.
            </p>
            <p>
                Сайт являє собою ресурс в мережі «Інтернет», доступ до якого
                надається за допомогою реєстрації на Сайті і подальшому введенні
                даних Відвідувача (адреса електронної пошти, номер телефону і
                пароль) на Сайті або за допомогою авторизації через соціальну
                мережу/ресурс по кнопці доступу на Сайті.
            </p>
            <p>
                Використання сервісів Сайту означає безумовну згоду Відвідувача
                Сайту з цією Політикою, правилами конкурсу “EPAM BOT CHALLENGE”
                (далі – «Конкурс»), організованого Компанією (далі – «Правила
                конкурсу») і зазначеними в них умовами. В разі незгоди з цими
                умовами Відвідувач Сайту повинен утриматися від використання
                сервісів Сайту.
            </p>
            <div className='subTitle'>§1 Загальні положення</div>
            <ol>
                <li>
                    1.1. Персональні дані - відомості чи сукупність відомостей
                    про фізичну особу, яка ідентифікована або може бути
                    конкретно ідентифікована.
                </li>
                <li>
                    1.2. Обробка персональних даних - будь-яка дія або
                    сукупність дій, таких як збирання, реєстрація, накопичення,
                    зберігання, адаптування, зміна, поновлення, використання і
                    поширення (розповсюдження, реалізація, передача), включаючи
                    передачу юридичним особам в рамках групи компаній ЕПАМ (в
                    тому числі іноземним суб'єктам відносин, пов'язаних з
                    персональними даними), знеособлення, знищення персональних
                    даних, в тому числі з використанням інформаційних
                    (автоматизованих) систем.
                </li>
                <li>
                    1.3. Всі інші поняття використовуються в значенні,
                    визначеному чинним законодавством.
                </li>
                <li>
                    { ' ' }
                    1.4. Використовуючи Сайт і надаючи свої персональні дані,
                    Відвідувач Сайту дає згоду на обробку персональних даних
                    відповідно до даної Політики.
                </li>
                <li>
                    { ' ' }
                    1.5. Суб'єкти персональних даних і Компанія мають права і
                    несуть обов'язки в області персональних даних відповідно до
                    чинного законодавства.{ ' ' }
                </li>
                <li>
                    { ' ' }
                    1.6. Ця Політика застосовується тільки до Сайту. Сайт не
                    контролює і не несе відповідальності за сайти третіх осіб,
                    на які Відвідувач Сайту може перейти за допомогою Сайту.
                </li>
            </ol>
            <div className='subTitle'>
                §2 Цілі збору та обробки персональних даних Відвідувача Сайту
            </div>
            <p>
                2.1. Компанія збирає і обробляє персональні дані Відвідувача
                виключно з метою, для якої вони збиралися/надавалися, в тому
                числі:
            </p>
            <ol>
                <li>
                    - надання Відвідувачу Сайту можливості входу на Сайт і
                    доступу до ресурсів Сайту;
                </li>
                <li>- організації та проведення Конкурсу;</li>
                <li>
                    - отримання Відвідувачем Сайту, який є учасником Конкурсу,
                    (далі – «Учасник») призу в разі його присудження;
                </li>
                <li>
                    - розгляд питання про укладення трудового або
                    цивільно-правового договору з Відвідувачем Сайту;
                </li>
                <li>
                    - встановлення зворотного зв'язку з Відвідувачем Сайту (в
                    тому числі направлення Відвідувачу Сайту листів) для
                    зазначених вище цілей (в тому числі уточнення персональних
                    даних Відвідувача Сайту і направлення йому пропозицій про
                    укладення трудового або цивільно-правового договору,
                    розсилок, особиста комунікація з боку Компанії) і
                    повідомлення Відвідувача Сайту про внесені зміни в цю
                    Політику щодо цілей обробки, складу оброблюваних
                    персональних даних і третіх осіб, яким вони можуть
                    передаватися / бути доступні, або про внесені зміни в
                    Правила конкурсу;
                </li>
                <li>
                    - рекламна/маркетингова мета, включаючи проведення промоції
                    Конкурсу, направлення Відвідувачу Сайту новин про заходи, що
                    проводяться Компанією, і запрошень на такі заходи,
                    таргетованої реклами в пошукових мережах і соціальних
                    мережах;{ ' ' }
                </li>
                <li>
                    - занесення персональних даних Відвідувача Сайту в
                    інформаційні системи персональних даних Компанії для
                    формування кадрового резерву або бази потенційних
                    контрагентів в рамках групи компаній ЕПАМ з метою розгляду
                    питання про укладення трудового або цивільно-правового
                    договору між Відвідувачем Сайту і юридичною особою з групи
                    компаній ЕПАМ;
                </li>
                <li>
                    - здійснення взаємодії (обмін інформацією) між Сайтом і
                    ресурсом telescope.epam.com, який проводить аналіз і
                    угруповання даних для Компанії;
                </li>
                <li>
                    - уточнення, підтвердження достовірності та повноти
                    персональних даних, наданих Відвідувачем Сайту;
                </li>
                <li>
                    - виконання повноважень та обов'язків, покладених на
                    Компанію чинним законодавством;
                </li>
                <li>
                    - файли «cookies» обробляються з метою, зазначеної в розділі
                    6 цієї Політики;
                </li>
                <li>- для іншої мети за згодою Відвідувача Сайту.</li>
            </ol>
            <div className='subTitle'>
                §3 Правові підстави обробки персональних даних
            </div>
            <ol>
                <li>
                    3.1. Правовими підставами обробки персональних даних
                    Компанією є:
                </li>
                <li>
                    3.1.1. згода суб'єкта персональних даних на обробку його
                    персональних даних. Згода може бути отримана в будь-якій
                    формі, що дозволяє підтвердити факт її отримання. При
                    реєстрації на Сайті і надання своїх персональних даних
                    шляхом заповнення полів анкети Відвідувач дає свою згоду на
                    обробку персональних даних шляхом проставлення відмітки
                    («галочки») в поле «Я згоден (на) на обробку моїх
                    персональних даних»;
                </li>
                <li>
                    3.1.2. необхідність виконання Компанією обов'язку володільця
                    персональних даних, який передбачений законодавством;
                </li>
                <li>
                    3.1.3. інші законні підстави для обробки персональних даних
                    відповідно до чинного законодавства.
                </li>
            </ol>
            <div className='subTitle'>
                §4 Обсяг і категорії оброблюваних персональних даних, категорії
                суб'єктів персональних даних
            </div>
            <p>
                4.1. Компанія виробляє обробку персональних даних Відвідувачів
                Сайту, зазначені Відвідувачами Сайту та/або зібраних автоматично
                при реєстрації на Сайті (створенні облікового запису), включаючи
                нікнейм (прізвище, ім'я), адреса електронної пошти, аватар
                (фотографію), а також персональні дані з профілю Відвідувача в
                соціальної мережі/у ресурсу в мережі «Інтернет» (Facebook,
                LinkedIn, Twitter, аккаунт Google, GitHub тощо), з використанням
                якої / -ого Відвідувачем здійснюється вхід на Сайт, в тому числі
                нікнейм (прізвище, ім'я), аватар (фотографія) Відвідувача,
                адреса електронної пошти з соціальної мережі/ ресурсу в мережі
                «Інтернет», мережевий ідентифікатор (ID) профілю Відвідувача в
                соціальній мережі/ ресурсі в мережі «Інтернет», мережевий
                ідентифікатор (ID) Відвідувача на Сайте та інші надані
                ідентифікатори (ID), автоматично визначуване на підставі
                використовуваного IP-адреси місце знаходження (країна)
                Відвідувача, а також персональні дані, зазначені Відвідувачем у
                створюваному їм на Сайті профілі або іншим чином переданих їм
                Компанії, включаючи громадянство (в разі зазначення), прізвище,
                ім'я, по батькові, контактний телефон, відомості про освіту
                (найменування навчального закладу, напрямок/спеціальність, курс,
                форма навчання, отримана кваліфікація), відомості про наявний
                досвід роботи/діяльності, в тому числі щодо займаних посад,
                виконуваних робіт, надаваних послуг, наявних уміннях і навичках
                (включаючи технології програмування, мови програмування і т.д.),
                рівень володіння іноземними мовами, бажаний вид і характер
                співпраці з Компанією або юридичними особами групи компаній ЕПАМ
                (в тому числі передбачувані види діяльності, виконувані роботи,
                надані послуги в рамках планованих до укладання
                цивільно-правових договорів, строки і порядок виконання робіт,
                надання послуг, розмір винагороди і т. д.), бажаний час для
                зворотного зв'язку з Відвідувачем, посилання на акаунти в
                соціальних мережах, відомості з супровідного листа, дані
                паспорту громадянина України та реєстраційний номер облікової
                картки платника податків з Державного реєстру фізичних
                осіб-платників податків (включаючи їх копії), зображення
                Учасника у вигляді фотографій чи аудіо-, відеозаписів, інтерв'ю,
                інші відомості, зібрані в автоматичному режимі (IP-адреси
                пристроїв, з допомогою яких відвідується Сайт, тип пристрою,
                дата і час відвідування Сайту, поновлення та видалення або
                знищення даних, відомості про дії на Сайті, файли «cookies»), в
                т.ч. з використанням метричних програм (систем) Яндекс.Метрика,
                Google Analytics, Google Tag Manager, Google reCAPTCHA, .NET
                фреймворку, IS3 компонента, провайдерів авторизації LinkedIn,
                Facebook, аккаунта Google, Twitter, Github та інших.
            </p>
            <div className='subTitle'>
                §5 Порядок та умови обробки персональних даних
            </div>
            <p>
                5.1. Обробка персональних даних здійснюється на основі наступних
                принципів:
            </p>
            <ol>
                <li>
                    - мета обробки персональних даних повинна бути чіткою і
                    законною, а також повинна бути визначена до початку їх
                    збору;
                </li>
                <li>
                    - обробка персональних даних здійснюється володільцем
                    персональних даних лише за згодою суб'єкта персональних
                    даних, за винятком тих випадків, коли така згода не
                    вимагається чинним законодавством;
                </li>
                <li>
                    - згода суб'єкта на обробку його персональних даних повинна
                    бути добровільною та інформованою. Згода може надаватися
                    суб'єктом у письмовій або електронній формі, що дає змогу
                    зробити висновок про її надання;
                </li>
                <li>
                    - обробка персональних даних здійснюється відкрито і прозоро
                    із застосуванням засобів та у спосіб, що відповідають
                    визначеним цілям такої обробки;
                </li>
                <li>
                    - у разі зміни визначеної мети обробки персональних даних на
                    нову мету, яка є несумісною з попередньою, для подальшої
                    обробки даних володілець персональних даних повинен отримати
                    згоду суб'єкта персональних даних на обробку його даних
                    відповідно до зміненої мети, якщо інше не передбачено чинним
                    законодавством;
                </li>
                <li>
                    - персональні дані мають бути точними, достовірними та
                    оновлюватися в міру потреби, визначеної метою їх обробки;
                </li>
                <li>
                    - склад та зміст персональних даних мають бути відповідними,
                    адекватними та ненадмірними стосовно визначеної мети їх
                    обробки;
                </li>
                <li>
                    - обробка персональних даних здійснюється для конкретних і
                    законних цілей, визначених за згодою суб'єкта персональних
                    даних, або у випадках, передбачених чинним законодавством, у
                    порядку, встановленому законодавством;
                </li>
                <li>
                    - не допускається обробка даних про фізичну особу, які є
                    конфіденційною інформацією, без її згоди, крім випадків,
                    визначених чинним законодавством, і лише в інтересах
                    національної безпеки, економічного добробуту та прав людини;
                </li>
                <li>
                    - персональні дані обробляються у формі, що допускає
                    ідентифікацію фізичної особи, якої вони стосуються, не
                    довше, ніж це необхідно для законних цілей, у яких вони
                    збиралися або надалі оброблялися. Подальша обробка
                    персональних даних в історичних, статистичних чи наукових
                    цілях може здійснюватися за умови забезпечення їх належного
                    захисту.
                </li>
                <li />
            </ol>
            <p>
                5.2. Обробка персональних даних Відвідувача Сайту здійснюється
                протягом строку обробки, зазначеного в згоді суб'єкта
                персональних даних, до моменту відкликання такої згоди, якщо
                немає інших законних підстав для обробки персональних даних
                Відвідувачів Сайту. Обробка персональних даних може
                здійснюватися будь-яким законним способом, в тому числі в
                інформаційних системах персональних даних з використанням
                засобів автоматизації або без використання таких засобів.{ ' ' }
            </p>
            <p>
                5.3. Компанія зобов'язується не розкривати третім особам і не
                поширювати персональні дані без згоди суб'єкта персональних
                даних, якщо інше не передбачено законодавством, за винятком
                передачі персональних даних Відвідувача Сайту (надання доступу
                до персональних даних) уповноваженим особам (працівникам та
                представникам) Компанії та юридичних осіб з групи компаній ЕПАМ,
                іншим особам, зазначеним у цій Політиці та згоді на обробку
                персональних даних, наданої Відвідувачем Сайту.
            </p>
            <p>
                5.4. Компанія зобов'язується зробити розумні зусилля з належного
                захисту персональних даних при їх обробці. Компанія застосовує
                правові, організаційні та технічні заходи, спрямовані на
                запобігання їх випадковим втратам або знищенню, незаконній
                обробці, у тому числі незаконному знищенню чи доступу до
                персональних даних, в тому числі:{ ' ' }
            </p>
            <p>
                - запобігання впровадження в інформаційні системи, що обробляють
                персональні дані, шкідливих програм і програмних закладок;
            </p>
            <p>
                - виявлення вторгнень в інформаційні системи, які обробляють
                персональні дані, що порушують або створюють передумови до
                порушення встановлених вимог щодо забезпечення безпеки
                персональних даних;
            </p>
            <p>- аналіз захищеності інформаційних систем персональних даних.</p>
            <p>
                5.5. Доступ до персональних даних Відвідувачів Сайту надається
                тільки уповноваженим особам (працівникам та представникам)
                Компанії та юридичних осіб групи компаній ЕПАМ, іншим особам,
                зазначеним у цій Політиці та згоді на обробку персональних
                даних, наданої Відвідувачем Сайту.
            </p>
            <p>
                5.6. Внутрішній контроль за відповідністю обробки персональних
                даних законодавству та прийнятим відповідно до них
                нормативно-правовими актами здійснюється в порядку,
                встановленому чинним законодавством.
            </p>
            <p>
                5.7. Компанія веде облік операцій, пов'язаних з обробкою
                персональних даних Відвідувачів Сайту та доступом до них. З цією
                метою Компанією зберігається інформація про:
            </p>
            <p>
                - дату, час та джерело збирання персональних даних Відвідувачів
                Сайту;
            </p>
            <p>- зміну персональних даних Відвідувачів Сайту;</p>
            <p>- перегляд персональних даних Відвідувачів Сайту;</p>
            <p>
                - будь-яку передачу (копіювання) персональних даних Відвідувачів
                Сайту;
            </p>
            <p>
                - дату та час видалення або знищення персональних даних
                Відвідувачів Сайту;
            </p>
            <p>- особи, яка здійснила одну із указаних операцій;</p>
            <p>
                - мету та підстави зміни, перегляду, передачі та видалення або
                знищення персональних даних Відвідувачів Сайту.
            </p>
            <p>
                Компанія самостійно визначає процедуру збереження інформації про
                операції, пов'язані з обробкою персональних даних Відвідувачів
                Сайту та доступом до них. Сайт автоматично фіксує вказану
                інформацію. Ця інформація зберігається Компанією упродовж одного
                року з моменту закінчення року, в якому було здійснено зазначені
                операції, якщо інше не передбачено чинним законодавством.
            </p>
            <p>
                5.8. Оскільки Компанія є юридичною особою, яка входить до
                міжнародної групи компаній ЕПАМ, а Сайт використовується всіма
                юридичними особами з даної групи компаній, персональні дані
                Відвідувача Сайту надаються і можуть бути доступні всім
                юридичним особам, що входять в дану групу, і використовуватися
                ними виключно з метою, зазначеної в цій Політиці та згоді на
                обробку персональних даних, наданої Відвідувачем Сайту.
            </p>
            <div className='subTitle'>§6 Файли «cookies»</div>
            <p>
                6.1. З метою поліпшення роботи Сайту, підвищення зручності та
                ефективності роботи Відвідувача з Сайтом, надання рішень та
                послуг, які найбільш відповідають потребам Відвідувача Сайту,
                визначення переваг Відвідувача, відображення рекламних оголошень
                (поведінкової реклами), а також для забезпечення технічної
                можливості функціонування Сайту Компанії необхідно зберігати і
                накопичувати інформацію про те, як Відвідувач Сайту використовує
                даний Сайт. Для цього використовуються невеликі за розміром
                текстові файли, які називаються «cookies». «Cookies» містять
                невеликі обсяги інформації і завантажуються на комп'ютер
                Відвідувача Сайту або інший пристрій з сервера Сайту Компанії.
                Більш детальну інформацію про «cookies» та принципи їх роботи
                можна знайти на ресурсі http://www.aboutcookies.org/.{ ' ' }
            </p>
            <p>
                6.2. Коли Відвідувач заходить на Сайт, Компанія використовує
                декілька програм (систем), які можуть встановлювати файли
                «cookies», теги, пікселі і аналогічні технології відстеження
                (спільно іменовані файли «cookies») на пристрої Відвідувача
                Сайту, в браузері або на веб-сторінці, що переглядається
                Відвідувачем Сайту, з метою персоналізації налаштувань
                (наприклад, мовні переваги) відвідувача Сайту, забезпечення
                розуміння характеру використання, надання, поліпшення і захисту
                Сайту.
            </p>
            <p>
                6.3. Сайт використовує різні типи файлів «cookies» для різних
                цілей, а саме:
            </p>
            <p>
                6.3.1. Абсолютно необхідні файли «cookies»: дані файли «cookies»
                необхідні для того, щоб Відвідувач Сайту міг переміщатися по
                Сайту і використовувати його функції. Без таких файлів неможливо
                використовувати основний функціонал Сайту.
            </p>
            <p>
                6.3.2. Експлуатаційні файли «cookies»: дані файли «cookies»
                збирають інформацію про те, як Відвідувач Сайту використовує
                Сайт. Зібрана інформація включає, наприклад, використовувані
                браузери і операційні системи, доменне ім'я раніше відвіданого
                веб-сайту, кількість відвідувань, середню тривалість
                відвідування та переглянуті сторінки. Такі файли «cookies» не
                збирають інформацію, яка ідентифікує Відвідувача Сайту особисто,
                і укрупнені дані (дані, зібрані і виражені в узагальненому
                вигляді для цілей статистичного аналізу і не є персональними
                даними відповідно до чинного законодавства). Експлуатаційні
                файли «cookies» використовуються для підвищення зручності
                користування Сайтом і підвищення ступеня задоволеності
                Відвідувача Сайту роботою Сайту.
            </p>
            <p>
                6.3.3. Функціональні файли «cookies»: дані файли «cookies»
                дозволяють Сайту запам'ятовувати вибрані Відвідувачем Сайту
                варіанти (наприклад, ім'я Відвідувача Сайту або мережевий
                ідентифікатор (ID), мовні настройки або область або регіон, в
                якому знаходиться Відвідувач Сайту) і надають розширені, більш
                персоналізовані функції Сайту. Ці файли «cookies» також можна
                використовувати для запам'ятовування змін, внесених Відвідувачем
                Сайту в розмір тексту, шрифти та інші частини веб-сторінок, що
                настроюються. Інформацію, яку збирають такі файли «cookies»,
                можливо знеособити; дані файли «cookies» не можуть відстежувати
                активність Відвідувача Сайту на інших сайтах.
            </p>
            <p>
                6.4. Користуючись Сайтом, Відвідувач Сайту погоджується на те,
                що Компанія може використовувати експлуатаційні і перенапраямні
                файли «cookies» сторонніх сервісів, таких як метричні програми
                (системи) Google Analytics, Яндекс.Метрика, Google Tag Manager,
                Google reCAPTCHA, .NET фреймворку, IS3 компонента, провайдерів
                авторизації LinkedIn, Facebook, аккаунта Google, Twitter, Github
                і тощо. для збору інформації про онлайн-дії Відвідувача Сайту на
                Сайті і інших сайтах групи компаній ЕПАМ. Така інформація
                використовується для відображення рекламних оголошень з
                урахуванням інтересів Відвідувача Сайту (поведінкова реклама), а
                також для збору інформації, яка допомагає відслідковувати і
                керувати ефективністю рекламних оголошень і кількістю
                відвідувачів. Це означає, що Компанія може показувати рекламні
                оголошення виходячи з минулих відвідувань Сайту через видавничі
                мережі, такі як Google Content Network (GCN). З додатковою
                інформацією про такі файли «cookies» можна ознайомитися на
                веб-сайті відповідної третьої сторони. Відвідувач Сайту також
                може отримати більше інформації про певні рекламні оголошення
                (поведінкова реклама) і відмову від них, відвідавши такі сайти:
                Digital Advertising Alliance-US, Network Advertising Initiative,
                Digital Advertising Alliance-Canada, European Interactive
                Digital Advertising Alliance, www.aboutcookies. org,
                www.allaboutcookies.org або налаштування пристрою Відвідувача
                Сайту для мобільного застосування Сайту. Відвідувач Сайту також
                може змінити налаштування реклами в мережі Google Display
                Network або відмовитися від них за адресою:
                http://www.google.com/settings/ads/.
            </p>
            <p>
                6.5. Якщо Відвідувач Сайту не згоден з деякими видами
                використання файлів «cookies», описаними вище, Відвідувач Сайту
                може скористатися налаштуваннями свого браузера або не
                використовувати Сайт. Якщо Відвідувач Сайту вирішить відмовитися
                від використання файлів «cookies» через настройки браузера,
                Відвідувач Сайту все одно зможе використовувати Сайт, хоча
                доступ Відвідувача Сайту до деяких функцій і веб-сторінок Сайту
                може бути обмежений. Оскільки засоби, за допомогою яких
                Відвідувач Сайту може відмовитися від збору Компанією файлів
                «cookies» через елементи управління браузера, відрізняються в
                залежності від браузера, для отримання додаткової інформації
                Відвідувачу Сайту слід звернутися до меню довідки браузера,
                використовуваного Відвідувачем Сайту.
            </p>
            <p>
                6.5.1. Інформація про те, як змінювати налаштування файлів
                «cookies» в браузері Google Chrome, доступна на ресурсі:
                https://support.google.com/chrome/answer/95647?hl=en
            </p>
            <p>
                6.5.2. Інформація про те, як змінювати налаштування файлів
                «cookies» в браузері Microsoft Internet Explorer, доступна на
                ресурсі:
                https://support.microsoft.com/en-us/help/278835/how-to-delete-cookie-files-in-internet-explorer
            </p>
            <p>
                6.5.3. Інформація про те, як змінювати налаштування файлів
                «cookies» в браузері Mozilla Firefox, доступна на ресурсі:
                https://support.mozilla.org/en-US/kb/delete-cookies-remove-info-websites-stored
            </p>
            <p>
                6.5.4. Інформація про те, як змінити налаштування «cookies» в
                браузері Apple Safari, доступна на ресурсі:
                https://support.apple.com/guide/safari/manage-cookies-and-website-data-sfri11471/mac
            </p>
            <p>
                6.6. Відвідувач Сайту повинен враховувати, що в даний час Сайт
                не налаштований для обробки сигналів браузера «Не відстежувати».{ ' ' }
            </p>
            <p>
                6.7. Щоб звернутися до Компанії з приводу використання файлів
                «cookies», Відвідувач Сайту може відправити повідомлення по
                електронній пошті OrgBotChallengeUA@epam.com.
            </p>
            <p>
                6.8. Кнопки доступу до соціальних мереж/ресурсів в мережі
                «Інтернет», що розміщені на Сайті, використовуються для того,
                щоб Відвідувачі Сайту могли увійти на Сайт через такі соціальні
                мережі/ресурси або поділитися посиланням на веб-сторінку або
                зробити електронну закладку. Дані кнопки є посиланнями на
                веб-сайти соціальних мереж, що належать третім особам, які, в
                свою чергу, можуть фіксувати інформацію про активність
                Відвідувачів в мережі «Інтернет», в тому числі на даному
                веб-сайті. Відвідувачам рекомендується ознайомитися з
                відповідними умовами використання та політикою конфіденційності
                таких сайтів для розуміння того, як вони використовують
                персональні і інші дані Відвідувачів, і того, як можна
                відмовитися від використання ними персональних та інших даних
                Відвідувачів або видалити їх. Компанія не несе відповідальності
                за правила або політику обробки даних і захисту інформації,
                прийняті на цих ресурсах.
            </p>
            <p>
                6.9. На даному Сайті можуть бути використані сторонні
                веб-сервіси для відображення тих чи інших елементів, наприклад,
                для відображення зображень, перегляду відео або організації
                голосувань / опитувань. Так само, як і в випадку з кнопками
                доступу до соціальних мереж (п. 6.8 цієї Політики), Компанія не
                може перешкоджати збору цими сайтами або зовнішніми доменами
                інформації про те, як Відвідувачі використовують зміст Сайту.
                Сайт також може містити посилання на інші веб-сайти, які
                підтримуються третіми особами. Компанія не несе відповідальності
                за правила або політику захисту інформації, прийняті на цих
                ресурсах. Відвідувачам рекомендується ознайомитися з політикою
                захисту інформації кожного відвідуваного ними веб-сайту.
            </p>
            <p>
                6.10. На власний розсуд Компанія може періодично вносити зміни
                або доповнення в ці умови використання файлів «cookies».
                Компанія закликає Відвідувачів періодично перечитувати цю
                Політику для ознайомлення зі способами використання файлів
                «cookies».
            </p>

            <div className='subTitle'>
                §7 Зміна, видалення та знищення персональних даних, порядок
                доступу до персональних даних, відкликання згоди на обробку
                персональних даних
            </div>
            <p>
                7.1. Відвідувач Сайту має право пред'являти вмотивовану вимогу
                щодо заборони обробки своїх персональних даних (їх частини),
                зміни або знищення своїх персональних даних Компанією, якщо ці
                дані обробляються незаконно чи є недостовірними. Така вимога
                розглядається Компанією впродовж 10 (десяти) днів з моменту
                отримання. Компанія зобов'язана вносити зміни до персональних
                даних на підставі вмотивованої письмової вимоги Відвідувача
                Сайту, а також за зверненням інших суб'єктів відносин,
                пов'язаних із персональними даними, якщо на це є згода
                Відвідувача Сайту чи відповідна зміна здійснюється згідно з
                приписом уповноваженого органу / посадової особи, чи за рішенням
                суду, що набрало законної сили. Зміна персональних даних, які не
                відповідають дійсності, проводиться невідкладно з моменту
                встановлення невідповідності, а обробка недостовірних або
                незаконно оброблюваних персональних даних повинна бути
                припинена, про що Компанія інформує Відвідувача Сайту. У разі
                якщо вимога не підлягає задоволенню, Відвідувачу Сайту надається
                мотивована відповідь щодо відсутності підстав для її
                задоволення.
            </p>
            <p>
                7.2. Персональні дані видаляються або знищуються в порядку,
                встановленому відповідно до вимог чинного законодавства. При
                досягненні цілей збору та обробки персональних даних, а також в
                разі відкликання Відвідувачем Сайту згоди на їх обробку
                персональні дані підлягають знищенню, якщо:
            </p>
            <p>
                - Компанія не має права здійснювати обробку без згоди суб'єкта
                персональних даних на підставах, передбачених чинним
                законодавством;
            </p>
            <p>
                - інше не передбачено в згоді суб'єкта персональних даних, іншої
                угоді між Компанією і суб'єктом персональних даних.
            </p>
            <p>
                7.3. Компанія повідомляє Відвідувача Сайту про склад і зміст
                зібраних персональних даних, його права, визначені чинним
                законодавством, мету збору персональних даних та третіх осіб,
                яким передаються його персональні дані, в момент збору
                персональних даних на Сайті. Про зміну, видалення чи знищення
                персональних даних або обмеження доступу до них Компанія
                протягом 10 (десяти) робочих днів повідомляє Відвідувача Сайту,
                а також суб'єктів відносин, пов'язаних із персональними даними,
                яким ці дані було передано.
            </p>
            <p>
                7.4. Відвідувач Сайту має право на одержання будь-яких
                відомостей про себе за запитом, що направляється рекомендованим
                листом або передається особисто за адресою: Україна, г. Київ,
                вул. Фізкультури 28, 03150, із зазначенням наступної інформації
                щодо себе: прізвище, ім'я та по батькові, місце проживання
                (місце перебування) і реквізити документа, що посвідчує фізичну
                особу, яка подає запит. Відстрочення доступу Відвідувача Сайту
                до своїх персональних даних не допускається.{ ' ' }
            </p>
            <p>
                7.5. Відвідувач Сайту має право в будь-який час відкликати згоду
                на обробку його персональних даних шляхом письмового
                повідомлення про відкликання, надісланого рекомендованим листом
                або переданого особисто Відвідувачем Сайту за адресою: Україна,
                г. Київ, вул. Фізкультури 28, 03150 або за адресою електронної
                пошти: OrgBotChallengeUA@epam.com. Відкликання згоди на обробку
                персональних даних Учасником унеможливлює подальшу участь такого
                Учасника у Конкурсі.
            </p>
            <div className='subTitle'>§8 Прикінцеві положення</div>
            <p>
                8.1. Компанія має право вносити зміни і доповнення в цю
                Політику, в разі необхідності, а також у разі внесення
                відповідних змін до чинного законодавства.
            </p>
            <p>
                8.2. При внесенні змін в актуальній редакції Політики вказується
                дата останнього оновлення. Нова редакція Політики набирає
                чинності з моменту її розміщення на Сайті, якщо інше не
                передбачено новою редакцією Політики. Продовжуючи користуватися
                Сайтом Відвідувач Сайту підтверджує згоду з внесеними змінами і
                доповненнями в Політику.
            </p>
            <p>
                8.3. Чинна редакція Політики постійно доступна на сторінці за
                адресою: ___________.
            </p>

            <div className='subTitle'>§4 Згода Учасника</div>
            <ol>
                <li>
                    Цим надаю свою добровільну, конкретну, інформовану і свідому
                    згоду ТОВ «ЕПАМ СИСТЕМЗ» (юридична та поштова адреса:
                    Україна, г. Київ, вул. Фізкультури 28, 03150) (далі –
                    «Компанія») на обробку моїх наступних персональних даних, що
                    збираються через сайт http://epam-bot-challenge.com.ua (далі
                    – «Сайт») або іншим чином передаються мною Компанії:
                </li>
                <li>
                    нікнейм (прізвище, ім'я), адреса електронної пошти, аватар
                    (фотографію), що зазначені мною при реєстрації на сайті
                    Login.telescopeAi.com (створення облікового запису), а також
                    персональні дані, зібрані автоматично з мого профілю в
                    соціальної мережі/у ресурсу в мережі «Інтернет» (Facebook,
                    LinkedIn, Twitter, аккаунт Google, GitHub і т. д.), з
                    використанням якої / -ого мною здійснюється вхід через
                    Login.telescopeAi.com на Сайт, в тому числі нікнейм
                    (прізвище, ім'я), аватар (фотографія), адреса електронної
                    пошти з соціальної мережі/ ресурсу в мережі «Інтернет»,
                    мережевий ідентифікатор (ID) мого профілю в соціальній
                    мережі/ ресурсі в мережі «Інтернет», мій мережевий
                    ідентифікатор (ID) на Сайте та інші надані ідентифікатори
                    (ID), автоматично визначуване на підставі використовуваного
                    IP-адреси місце знаходження (країна), а також персональні
                    дані, зазначені мною у створюваному мною на Сайті профілі,
                    включаючи громадянство (в разі зазначення), прізвище, ім'я,
                    по батькові, контактний телефон, відомості про освіту
                    (найменування навчального закладу, напрямок/спеціальність,
                    курс, форма навчання, отримана кваліфікація), відомості про
                    наявний досвід роботи / діяльності, в тому числі щодо
                    займаних посад, виконуваних робіт, надаваних послуг, наявних
                    уміннях і навичках (включаючи технології програмування, мови
                    програмування і т.д.), рівень володіння іноземними мовами,
                    бажаний вид і характер співпраці з Компанією або юридичними
                    особами групи компаній ЕПАМ (в тому числі передбачувані види
                    діяльності, виконувані роботи, надані послуги в рамках
                    планованих до укладання цивільно-правових договорів, строки
                    і порядок виконання робіт, надання послуг, розмір винагороди
                    і т. д.), бажаний час для зворотного зв'язку зі мною,
                    посилання на акаунти в соціальних мережах, відомості з
                    супровідного листа, дані паспорту громадянина України та
                    реєстраційний номер облікової картки платника податків з
                    Державного реєстру фізичних осіб-платників податків
                    (включаючи їх копії), зображення у вигляді фотографій чи
                    аудіо-, відеозаписів, інтерв'ю, інші відомості, зібрані в
                    автоматичному режимі (IP-адреси пристроїв, з допомогою яких
                    відвідується Сайт, тип пристрою, дата і час відвідування
                    Сайту, поновлення та видалення або знищення даних, відомості
                    про дії на Сайті, файли «cookies»), в т.ч. з використанням
                    метричних програм (систем) Яндекс.Метрика, Google Analytics,
                    Google Tag Manager, Google reCAPTCHA, .NET фреймворку, IS3
                    компонента, провайдерів авторизації LinkedIn, Facebook,
                    аккаунта Google, Twitter, Github та інших,
                </li>
                <li>
                    відповідно до умов обробки, викладених у Політиці
                    конфіденційності персональних даних Відвідувачів Сайту (далі
                    – «Політика»), а також відповідно до умов, передбачених
                    правилами конкурсу «EPAM BOT CHALLENGE» (далі – «Конкурс»),
                    організованого Компанією (далі – «Правила конкурсу»).{ ' ' }
                </li>
                <li>
                    Ця згода дається на вчинення наступних дій (операцій) або
                    сукупності дій (операцій): збирання, реєстрація,
                    накопичення, зберігання, адаптування, зміна, поновлення,
                    використання і поширення (розповсюдження, реалізація,
                    передача), включаючи передачу юридичним особам в рамках
                    групи компаній ЕПАМ (в тому числі іноземним суб'єктам
                    відносин, пов'язаних з персональними даними, знеособлення,
                    знищення персональних даних, в тому числі з використанням
                    інформаційних (автоматизованих) систем, включаючи шляхом
                    внесення в інформаційні системи персональних даних Компанії.{ ' ' }
                </li>
                <li>
                    Обробка моїх персональних даних на підставі цієї згоди може
                    здійснюватися Компанією з метою:
                </li>
                <li>
                    - надання мені можливості входу на Сайт і доступу до
                    ресурсів Сайту;
                </li>
                <li>- організації та проведення Конкурсу;</li>
                <li>
                    - отримання мною, якщо я є учасником Конкурсу, призу в разі
                    його присудження;
                </li>
                <li>
                    - розгляд питання про укладення зі мною трудового або
                    цивільно-правового договору;
                </li>
                <li>
                    - встановлення зі мною зворотного зв'язку (в тому числі
                    направлення мені листів) для зазначених вище цілей (в тому
                    числі уточнення моїх персональних даних і направлення мені
                    пропозицій про укладення трудового або цивільно-правового
                    договору, розсилок, особиста комунікація з боку Компанії) і
                    повідомлення мені про внесені зміни в Політику щодо цілей
                    обробки, складу оброблюваних персональних даних і третіх
                    осіб, яким мої персональні дані можуть передаватися / бути
                    доступні, або про внесені зміни в Правила конкурсу;
                </li>
                <li>
                    - рекламна/маркетингова мета, включаючи проведення промоції
                    Конкурсу, направлення мені новин про заходи, що проводяться
                    Компанією, і запрошень на такі заходи, таргетованої реклами
                    в пошукових мережах і соціальних мережах;{ ' ' }
                </li>
                <li>
                    - занесення моїх персональних даних в інформаційні системи
                    персональних даних Компанії для формування кадрового резерву
                    або бази потенційних контрагентів в рамках групи компаній
                    ЕПАМ з метою розгляду питання про укладення
                    цивільно-правового договору між мною і юридичною особою з
                    групи компаній ЕПАМ;
                </li>
                <li>
                    - здійснення взаємодії (обмін інформацією) між Сайтом і
                    ресурсом telescope.epam.com, який проводить аналіз і
                    угруповання даних для Компанії;
                </li>
                <li>
                    - уточнення, підтвердження достовірності та повноти
                    персональних даних, наданих мною;
                </li>
                <li>
                    - виконання повноважень та обов'язків, покладених на
                    Компанію чинним законодавством;
                </li>
                <li>
                    - файли «cookies» обробляються з метою поліпшення роботи
                    Сайту, підвищення зручності та ефективності моєї роботи з
                    Сайтом, надання рішень та послуг, які найбільш відповідають
                    моїм потребам, визначення моїх переваг, відображення
                    рекламних оголошень (поведінкової реклами), а також для
                    забезпечення технічної можливості функціонування Сайту. Я
                    згоден(на) з обробкою даних файлів з метою, докладно
                    описаної у розділі 6 Політики, з яким я ознайомився(лася).
                </li>
                <li>
                    Я розумію, що Компанія є юридичною особою, яка входить до
                    міжнародної групи компаній ЕПАМ, а Сайт використовується
                    всіма юридичними особами з даної групи компаній, в зв'язку з
                    чим я даю свою згоду на транскордонну передачу та надання
                    доступу до моїх персональних даних, зібраних через Сайт,
                    всім юридичним особам, що входять в дану групу, і
                    використання моїх персональних даних цими юридичними особами
                    виключно з метою, зазначеної у цієї згоді на обробку
                    персональних даних.
                </li>
                <li>
                    Ця згода діє з моменту її надання і протягом всього періоду
                    використання мною Сайту, моєї участі в Конкурсі, а також
                    протягом всього терміну розгляду Компанією питання про
                    співробітництво зі мною до моменту відкликання цієї згоди.
                    Протягом даного терміну Компанія, інші зазначені в Політиці
                    особи вправі обробляти, в тому числі зберігати, мої
                    персональні дані, зазначені в цієї згоді.
                </li>
                <li>
                    Мені відомо, що ця згода в будь-який момент може бути
                    відкликана мною за допомогою направлення в Компанію
                    відповідної вимоги в порядку, встановленому Політикою.
                </li>
                <li>
                    У разі відкликання згоди на обробку персональних даних я
                    проінформований(а) про необхідність припинити використання
                    Сайту або, в разі відкликання згоди тільки щодо обробки
                    файлів «cookies», відключити файли «cookies» в налаштуваннях
                    мого браузера.
                </li>
                <li>
                    Місцезнаходження моїх персональних даних (фактична адреса
                    обробки персональних даних): Україна, г. Київ, вул.
                    Фізкультури 28, 03150.{ ' ' }
                </li>
                <li>Права суб'єкта:</li>
                <li>
                    Я до моменту надання цієї згоди ознайомлений зі своїми
                    правами, передбаченими чинним законодавством, а саме:
                </li>
                <li>
                    - знати про джерела збирання, місцезнаходження своїх
                    персональних даних, мету їх обробки, місцезнаходження та /
                    або місце проживання (перебування) володільця чи
                    розпорядника персональних даних або дати відповідне
                    доручення щодо отримання цієї інформації уповноваженим мною
                    особам, крім випадків, встановлених чинним законодавством;
                </li>
                <li>
                    - отримувати інформацію про умови надання доступу до
                    персональних даних, зокрема інформацію про третіх осіб, яким
                    передаються мої персональні дані;
                </li>
                <li>- на доступ до своїх персональних даних;</li>
                <li>
                    - отримувати не пізніше як за 30 календарних днів з дня
                    надходження запиту, крім випадків, передбачених чинним
                    законодавством, відповідь про те, чи обробляються мої
                    персональні дані, а також отримувати зміст таких
                    персональних даних;
                </li>
                <li>
                    - пред’являти володільцю персональних даних вмотивовану
                    вимогу із запереченням проти обробки своїх персональних
                    даних;
                </li>
                <li>
                    - пред’являти вмотивовану вимогу щодо зміни або знищення
                    своїх персональних даних будь-яким володільцем та
                    розпорядником персональних даних, якщо ці дані обробляються
                    незаконно чи є недостовірними;
                </li>
                <li>
                    - на захист своїх персональних даних від незаконної обробки
                    та випадкових втрат, знищення, пошкодження у зв’язку з
                    умисним приховуванням, ненаданням або несвоєчасним їх
                    наданням, а також на захист від надання відомостей, що є
                    недостовірними чи ганьблять честь, гідність та ділову
                    репутацію фізичної особи;
                </li>
                <li>
                    - звертатися із скаргами на обробку своїх персональних даних
                    до уповноважених органів державної влади та посадових осіб
                    або до суду;
                </li>
                <li>
                    - застосовувати засоби правового захисту у разі порушення
                    законодавства про захист персональних даних;
                </li>
                <li>
                    - вносити застереження стосовно обмеження права на обробку
                    своїх персональних даних під час надання згоди;
                </li>
                <li>- відкликати згоду на обробку персональних даних;</li>
                <li>
                    - знати механізм автоматичної обробки персональних даних;
                </li>
                <li>
                    - на захист від автоматизованого рішення, яке має для мені
                    правові наслідки.
                </li>
                <li>
                    Цим я також підтверджую, що до надання даної згоди (в момент
                    збору персональних даних) я ознайомлений з:
                </li>
                <li>
                    - Політикою конфіденційності персональних даних Відвідувачів
                    Сайту (активне посилання на Політику), та Правилами конкурсу
                    (активне посилання на Правила конкурсу),
                </li>
                <li>
                    - правами, наданими мені відповідно до чинного законодавства
                    про персональні дані,
                </li>
                <li>
                    - інформацією про джерела збирання, місцезнаходження своїх
                    персональних даних, місцезнаходження або місце проживання
                    володільця та розпорядників персональних даних, склад та
                    зміст зібраних персональних даних, мету збору та обробки
                    моїх персональних даних та осіб, яким передаються
                    персональні дані, мети і підстави такої передачі, які дії з
                    персональними даними передбачає їх обробка, термін
                    зберігання, умови відкликання згоди, а також з іншою
                    інформацією в простій та зрозумілій формі, що дозволяє мені
                    дати інформовану, добровільну та свідому згоду на обробку
                    моїх персональних даних.
                </li>
                <li>
                    Я підтверджую, що в разі надання Сайту з мого боку
                    персональних даних (включаючи прізвище, ім'я, адреса
                    електронної пошти, мережевий ідентифікатор (ID) профілю в
                    соціальній мережі / ресурсі в мережі «Інтернет»)
                    незареєстрованих на Сайті осіб, мною попередньо отримана
                    згода таких осіб на обробку їх персональних даних Компанією
                    відповідно до цілей і умов, зазначених в Політиці.
                </li>
            </ol>
        </div>
    </div>
);

export default PrivacyPolicyContainer;
