// vendor
import React from 'react';

const PrivacyPolicyContainer = () => (
    <div className='container'>
        <div className='content'>
            <div className='title'>
                ПОЛІТИКА КОНФІДЕНЦІЙНОСТІ ТА ЗГОДА НА ОБРОБКУ ДАНИХ
                <br />
                в зв'язку з проведенням конкурсу “BOT CHALLENGE”,
                <br />
                який організовано ТОВ «QWE»
            </div>
            <div className='subTitle'>§1 Загальні положення</div>
            <ol>
                <li>
                    1. Ця Політика конфіденційності та згода на обробку даних
                    (далі «Політика») затверджено ТОВ «QWE»,
                    зареєстрованим за адресою м. Київ, вул. _______________,
                    _____, тел. +__ ___ ___-__-__, факс +__ ___ ___-__-__, що є
                    Організатором проведення конкурсу (далі - «Організатор»),
                    для цілей проведення конкурсу BOT CHALLENGE (далі –
                    «Конкурс»), з метою інформування Учасників конкурсу (далі –
                    як «Учасники»), зокрема, в частині збору та використання їх
                    персональних даних.
                </li>
                <li>
                    2. Ця Політика визначає умови, процедури та цілі обробки
                    персональних даних Учасників, включаючи їх збирання,
                    використання, реєстрацію, накопичення, зберігання,
                    адаптування, зміну, поновлення, поширення (розповсюдження,
                    передачу), знеособлення, знищення, у тому числі з
                    використанням інформаційних (автоматизованих) систем, а
                    також умови захисту персональних даних Учасників.
                </li>
                <li>
                    Політикою встановлюються способи, у межах яких Учасник може
                    переглядати, оновлювати та вимагати видалення персональних
                    даних відповідно до чинного законодавства.
                </li>
            </ol>
            <div className='subTitle'>§2 Обов’язки щодо персональних даних</div>
            <ol>
                <li>
                    1. Організатор зобов’язаний належно забезпечувати
                    конфіденційність отриманих від Учасника персональних даних
                    шляхом дотримання всіх застосовних норм законодавства про
                    захист персональних даних, зокрема, положень Закону України
                    «Про захист персональних даних».
                </li>
                <li>
                    2. Організатор за такої можливості зобов’язується вживати
                    технічних та організаційних заходів з метою захисту
                    персональних даних від несанкціонованого або випадкового
                    доступу, знищення, зміни, блокування, копіювання,
                    розповсюдження та інших незаконних дій третіх осіб,
                    включаючи захист усіх засобів спілкування з Учасником. Вся
                    інформація, надана Учасником, зберігається на серверах
                    Організатора або інших носіях інформації з метою
                    забезпечення належного рівня безпеки.
                </li>
                <li>
                    3. У разі, якщо Учасник дізнається, що його дані з
                    облікового запису на платформі{ ' ' }
                    <a href={ process.env.REACT_APP_EVENT_LINK }>
                        { process.env.REACT_APP_EVENT_LINK }
                    </a>{ ' ' }
                    було вкрадено або що вони перебувають у власності третіх
                    осіб при відсутності законних підстав, він повинен негайно
                    повідомити Організатора, для того щоб Організатор міг вжити
                    необхідних кроків.
                </li>
            </ol>
            <div className='subTitle'>§3 Збір персональних даних</div>
            <ol>
                <li>
                    1. Організатор має право просити надання інформації про
                    Учасника для цілей використання Учасником платформи{ ' ' }
                    <a href={ process.env.REACT_APP_EVENT_LINK }>
                        { process.env.REACT_APP_EVENT_LINK }
                    </a>
                    , організації та проведення Конкурсу, включаючи перевірку
                    інформації, пов’язаної з Учасником, допуск до участі і
                    подальшої участі у Конкурсі, отримання Учасником призу в
                    разі його присудження, та в інших цілях відповідно до згоди,
                    наданої Учасником шляхом згоди з Політикою, і це може
                    включати в себе персональні дані, зокрема адреси, адреси
                    електронної пошти, IP-адресу, дані cookies, номер телефону,
                    інформацію про посаду, місце проживання (в т.ч. місто),
                    спеціалізацію, ідентифікаційні дані (ID) у соціальних
                    мережах, ім’я, прізвище, по-батькові Учасника, дані паспорту
                    громадянина України та реєстраційний номер облікової картки
                    платника податків з Державного реєстру фізичних
                    осіб-платників податків (включаючи їх копії), зображень
                    Учасника у вигляді фотографій чи аудіо-відео записів,
                    інтерв'ю, пароль на платформі{ ' ' }
                    <a href={ process.env.REACT_APP_EVENT_LINK }>
                        { process.env.REACT_APP_EVENT_LINK }
                    </a>
                    , а також інші дані (надалі – «Дані»).
                </li>
                <li>
                    2. Надання Даних, зазначених в пункті 1 цього розділу вище,
                    є добровільним, але водночас є необхідною умовою для
                    використання Учасником платформи{ ' ' }
                    <a href={ process.env.REACT_APP_EVENT_LINK }>
                        { process.env.REACT_APP_EVENT_LINK }
                    </a>
                    , організації та проведення Конкурсу, включаючи перевірку
                    інформації, пов’язаної з Учасником, допуск до участі і
                    подальшу участь в Конкурсі, отримання Учасником призу в разі
                    його присудження.
                </li>
                <li>
                    3. У разі, якщо Учасник починає листування з Організатором
                    або використовує листування для будь-яких цілей контактів з
                    Організатором, Учасник погоджується, що Організатор має
                    право зберігати запис кореспонденції такого типу.
                </li>
            </ol>
            <div className='subTitle'>§4 Згода Учасника</div>
            <ol>
                <li>
                    1. Погоджуючись з Політикою, Учасник надає Організатору, як
                    володільцю персональних даних, безумовну добровільну та
                    інформовану згоду на обробку своїх Даних на умовах, описаних
                    в даній Політиці, включаючи збирання, використання,
                    реєстрацію, накопичення, зберігання, адаптування, зміну,
                    поновлення, поширення (розповсюдження, передачу третім
                    особам (в том числі іноземним суб'єктам відносин, пов'язаних
                    з персональними даними), зазначеним у справжній згоди),
                    знеособлення, знищення, внесення Даних до баз даних
                    Організатора та загальних баз даних Організатора та
                    організації, які входять в групу компаній QWE, в яку також
                    входить Організатор, у тому числі з використанням
                    інформаційних (автоматизованих) систем, в тому числі, але не
                    обмежуючись:
                    <ol>
                        <li>
                            1.1. використання імені, прізвища, зображення в
                            інтерв'ю або інших матеріалів про Учасника;
                        </li>
                        <li>
                            1.2. використання Даних (в т.ч. імені і зображення
                            Учасника) шляхом публікації в засобах масової
                            інформації, будь-яких друкованих, аудіо- та
                            відеоматеріалах, в т.ч. у газетах, на веб-сайтах,
                            постерах та білбордах, у соціальних мережах, форумах
                            та інших медіа та інформаційних носіях,
                            промо-матеріалах, маркетингових матеріалах тощо
                            (розсилки, ліфлети, тощо);
                        </li>
                        <li>
                            1.3. використання зображень Учасника в зазначених
                            вище та наступних формах:
                        </li>
                        <li>
                            1.3.1. запис та відтворення за допомогою будь-яких
                            відомих технологій, розповсюдження у будь-якій
                            формі;
                        </li>
                        <li>
                            1.3.2. відтворення шляхом запису зображень,
                            розміщених у будь-який спосіб та на будь-яких
                            носіях;
                        </li>
                        <li>
                            1.3.3. публічна демонстрація, презентація,
                            реконструкція, транслювання та ре-транслювання,
                            також як публічний доступ будь-якій особі у спосіб
                            та час, за її власним вибором;
                        </li>
                        <li>1.3.4. телевізійні та радіо-трансляції;</li>
                        <li>
                            1.3.5. публікація імені Учасника (вказаного при
                            реєстрації на Конкурс) в турнірній таблиці Конкурсу
                            й анонсах результатів Конкурсу в соціальних мережах;
                            без будь-яких обмежень за територією, часом та
                            способом використання Даних, і таке використання
                            жодним чином не відшкодовуватиметься Організатором
                            та/або будь-якою третьою особою, зазначеної в цій
                            Політиці (надалі – «обробка Даних»).
                        </li>
                    </ol>
                </li>
                <li>
                    2. Метою обробки, в т.ч. збирання, Даних є:
                    <ol>
                        <li>
                            2.1. забезпечення можливості використання Учасником
                            платформи{ ' ' }
                            <a href={ process.env.REACT_APP_EVENT_LINK }>
                                { process.env.REACT_APP_EVENT_LINK }
                            </a>
                            , організація та проведення Конкурсу, включаючи
                            перевірку інформації, пов’язаної з Учасником, допуск
                            до участі і подальшу участь у Конкурсі, в тому числі
                            забезпечення можливості отримання Учасником призу в
                            разі його присудження;
                        </li>
                        <li>
                            2.2. рекламна/маркетингова мета, в т.ч. проведення
                            промоції Конкурсу, надсилання Учаснику інформації,
                            різноманітних матеріалів, повідомлень (в т.ч.
                            рекламного характеру) тощо, для підтримання контакту
                            з Учасником у маркетингових цілях;
                        </li>
                        <li>
                            2.3. здійснення комунікації з Учасниками для
                            розгляду питання укладення з Учасниками трудового
                            або цивільно-правового договору за допомогою:
                            розсилок, особистої комунікації з боку Організатора,
                            таргетированной реклами в пошукових мережах і
                            соціальних мережах, подання пропозиції та інформації
                            про роботу, внесення в бази даних потенційних
                            контрагентів та кандидатів Організатора та
                            організації, які входять в групу компаній QWE, в
                            яку також входить Організатор.
                        </li>
                    </ol>
                </li>
                <li>
                    3. Розпорядниками персональних даних є особи, які за
                    дорученням Організатора обробляють персональні дані
                    Учасника, а саме уповноважені здійснювати збирання,
                    реєстрацію, накопичення, зберігання, адаптування, зміну,
                    поновлення, використання і поширення (розповсюдження,
                    передачу), знеособлення, знищення персональних даних, у тому
                    числі з використанням інформаційних (автоматизованих)
                    систем. Учасник дає згоду на доручення обробки персональних
                    даних Учасника Організатором розпорядникам з метою,
                    зазначеною в цієї згоді без необхідності повідомлення і /
                    або отримання додаткової згоди в кожному випадку такого
                    доручення. З метою виконання зазначених вище повноважень
                    розпорядники мають право отримувати персональні дані
                    Учасника з будь-яких законних джерел, в тому числі від
                    Учасника і від третіх осіб, а також обробляти Дані, в тому
                    числі персональні дані, які становить особливий ризик для
                    прав і свобод суб'єктів персональних даних, на що Учасник
                    дає повну та безумовну згоду.
                </li>
                <li>
                    4. Учасник погоджується, що Дані, отримані Організатором,
                    можуть бути надані працівникам та представникам Організатора
                    з метою здійснення повноважень Організатора, належного
                    проведення конкурсу та контролю представниками, призначеними
                    Організатором, технічних і основних питань, організаціям,
                    які входять в групу компаній QWE, в яку також входить
                    Організатор, з метою внутрішньокорпоративного обліку в
                    рамках групи компаній QWE, в т.ч. обліку потенційних
                    контрагентів та кандидатів в загальних базах даних
                    Організатора та організації, які входять в групу компаній
                    QWE, а також третім особам, які надають Організатору
                    послуги/виконують роботи з метою просування, організації та
                    проведення Конкурсу.
                </li>
                <li>
                    Учасник надає свою згоду на те, що у разі об’єднання
                    Організатора з іншою компанією у процесі реорганізації або
                    злиття, продажу, придбання, ліквідації або у будь-якому
                    іншому процесі, Дані Учасників можуть бути передані разом з
                    Організатором або як його частина або можуть буди продані як
                    частина активів Організатора.
                </li>
                <li>
                    5. Обробка, в т.ч. зберігання, Даних Учасника здійснюється
                    Організатором і третіми особами, зазначеними в цій Політиці,
                    з моменту отримання та протягом усього терміну організації
                    та проведення Конкурсу, а також після завершення Конкурсу до
                    моменту відкликання Учасником цієї згоди, якщо відсутні інші
                    законні підстави для обробки персональних даних.
                </li>
                <li>
                    6. Ця згода може бути відкликана Учасником в будь-який час
                    шляхом письмового повідомлення про відкликання, спрямованого
                    рекомендованим листом на адресу (г. Київ, вул. ____________
                    __, ______) або адресу електронної пошти
                    (codenjoyme@gmail.com) Організатора. Відкликання даної
                    згоди вступає в силу з дати отримання відповідного
                    повідомлення Організатором. Відкликання згоди тягне
                    припинення обробки персональних даних, якщо відсутні інші
                    підстави обробки персональних даних. У разі відкликання
                    згоди на обробку Даних Учасник не допускається до подальшої
                    участі у Конкурсі.
                </li>
                <li>
                    7. Учасник, погоджуючись з Політикою погоджується та
                    підтверджує, що він повідомлений та знає про джерела
                    збирання, місцезнаходження Даних, мету їх обробки,
                    місцезнаходження володільця Даних, про осіб, яким
                    передаються Дані, (розпорядників, третіх осіб), а також про
                    механізм автоматизованої обробки його персональних даних та
                    знає свої права, як суб’єкта персональних даних відповідно
                    до законодавства України.
                </li>
                <li>
                    8. Учасник має право у будь-який час зв’язатися з
                    Організатором з метою отримання копії своїх персональних
                    даних, які зберігаються Організатором та відповідного
                    виправлення будь-яких неточностей. Учасник має право
                    вимагати, щоб його персональні дані були вилучені,
                    виправлені, змінені або доповнені. Для того, щоб зв’язатися
                    з Організатором, Учасник повинен надіслати повідомлення на
                    адресу: codenjoyme@gmail.com.
                </li>
            </ol>
            <div className='subTitle'>§5 Обробка персональних даних</div>
            <ol>
                <li>
                    1. Усі особи, що мають доступ до персональних даних,
                    зобов’язані дотримуватись, за виключенням випадків,
                    передбачених чинним законодавством, умови цієї Політики та
                    будуть відбиратись із належною увагою критерію довіри.
                </li>
                <li>
                    2. Учасник надає свою згоду на те, що Організатор має право
                    та обов’язок розкривати персональні дані, якщо відповідне
                    рішення було винесено на підставі положень законодавства або
                    вимагається з боку державних органів, витребовується
                    правоохоронним органом або судом, або вимагається для
                    захисту персональних даних.
                </li>
            </ol>
            <div className='subTitle'>§6 Внесення Змін до Політики</div>
            <ol>
                <li>
                    Дійсною є найпізніша редакція цієї Політики. Цю Політику
                    може бути змінено (в т.ч.вдосконалено, замінено) у будь-якій
                    формі та в будь-який час, про що Учаснику буде надіслано
                    повідомлення на адресу електронної пошти Учасника, відому
                    Організатору, не пізніше дня публікації змін. Учасник
                    зобов'язується регулярно знайомитися із текстом цієї
                    Політики, щоб бути в курсі змін. Будь-які зміни цієї
                    Політики набувають чинності по витікання 5 робочих днів з
                    моменту їх публікації на веб-сайті:{ ' ' }
                    <a href={ process.env.REACT_APP_EVENT_LINK }>
                        { process.env.REACT_APP_EVENT_LINK }
                    </a>
                    . Учасник є згодним зі змінами в Політику, якщо в письмовій
                    формі не повідомив Організатора про зворотне. В разі якщо
                    Учасник не згоден зі зміненами в Політику, Учасник
                    зобов'язується повідомити про це Організатора у письмовій
                    формі на адресу (г. Київ, вул. __________ __, ______) або
                    адресу електронної пошти (codenjoyme@gmail.com)
                    Організатора. Незгода Учасника зі змінами в Політику, які
                    зачіпають обсяг згоди Учасника на обробку персональних
                    даних, тягне припинення обробки персональних даних Учасника
                    в частині таких змін, якщо відсутні інші підстави обробки
                    персональних даних. У разі незгоди Учасника зі змінами в
                    Політику Учасник не допускається до подальшої участі у
                    Конкурсі.
                </li>
            </ol>
            <div className='subTitle'>§7 Зв’язок з Організатором</div>
            <ol>
                <li>
                    1. У випадку виникнення у Учасника питань, коментарів, скарг
                    або відгуків щодо цієї Політики, вони підлягають надсиланню
                    Організатору на електронну пошту:
                    codenjoyme@gmail.com.
                </li>
                <li>
                    2. Організатор може відхилити розгляд таких заяв, зокрема
                    тих, виконання яких вимагатиме непропорційних технічних
                    зусиль або загрожує конфіденційності персональних даних
                    інших Учасників.
                </li>
            </ol>
        </div>
    </div>
);

export default PrivacyPolicyContainer;
