// vendor
import React from 'react';
import Icon from '../../styles/images/icons/rules.svg';

// own
import StylesList from '../../styles/css/styles.list.css';

const appUrl = process.env.REACT_APP_EVENT_LINK;
const privacyPolicyUrl = appUrl + '/privacyPolicy';
const orgEmail = process.env.REACT_APP_EVENT_ORG_EMAIL;

const PrivacyPolicyContainer = () => (
    <div className='container'>
        <div className='content'>
            <div className='title'>
                Політика конфіденційності персональних даних Відвідувачів сайту
                <br />
                <div className='notation'>(тут і далі – Політика)</div>
            </div>
            <p>
                Ця Політика конфіденційності персональних даних Відвідувачів
                сайту (далі – «Політика») прийнята ТОВ «____»/, юридична
                та поштова адреса: Україна, г. Київ, вул. ____________ __, ______
                (далі — «Компанія»), і діє у відношенні персональних даних, які
                Компанія може отримати відносно Відвідувача сайту
                &nbsp;
                <a href={ appUrl }>
                    { appUrl }<img src={ Icon } alt='Сайт Конкурсу' />
                </a>
                &nbsp;
                (далі – «Сайт»), з будь-якого
                пристрою і при комунікації з Компанією в будь-якій формі.
            </p>
            <p>
                Сайт являє собою ресурс в мережі «Інтернет», доступ до якого
                надається за допомогою реєстрації на Сайті і подальшому введенні
                даних Відвідувача (адреса електронної пошти, номер телефону і
                пароль) на Сайті або за допомогою авторизації через соціальну
                мережу/ресурс по кнопці доступу на Сайті.
            </p>
            <p>
                Використання сервісів Сайту означає безумовну згоду Відвідувача
                Сайту з цією Політикою, правилами конкурсу “BOT CHALLENGE”
                (далі – «Конкурс»), організованого Компанією (далі – «Правила
                конкурсу») і зазначеними в них умовами. В разі незгоди з цими
                умовами Відвідувач Сайту повинен утриматися від використання
                сервісів Сайту.
            </p>
            <ol>
                <li className='subTitle' id='details1'>
                    Загальні положення
                    <ol>
                        <li>
                            Персональні дані - відомості чи сукупність відомостей
                            про фізичну особу, яка ідентифікована або може бути
                            конкретно ідентифікована.
                        </li>
                        <li>
                            Обробка персональних даних - будь-яка дія або
                            сукупність дій, таких як збирання, реєстрація, накопичення,
                            зберігання, адаптування, зміна, поновлення, використання і
                            поширення (розповсюдження, реалізація, передача), включаючи
                            передачу юридичним особам в рамках групи компаній ____ (в
                            тому числі іноземним суб'єктам відносин, пов'язаних з
                            персональними даними), знеособлення, знищення персональних
                            даних, в тому числі з використанням інформаційних
                            (автоматизованих) систем.
                        </li>
                        <li>
                            Всі інші поняття використовуються в значенні,
                            визначеному чинним законодавством.
                        </li>
                        <li>
                            Використовуючи Сайт і надаючи свої персональні дані,
                            Відвідувач Сайту дає згоду на обробку персональних даних
                            відповідно до даної Політики.
                        </li>
                        <li>
                            Суб'єкти персональних даних і Компанія мають права і
                            несуть обов'язки в області персональних даних відповідно до
                            чинного законодавства.
                        </li>
                        <li>
                            Ця Політика застосовується тільки до Сайту. Сайт не
                            контролює і не несе відповідальності за сайти третіх осіб,
                            на які Відвідувач Сайту може перейти за допомогою Сайту.
                        </li>
                    </ol>
                </li>
                <li className='subTitle' id='details2'>
                    Цілі збору та обробки персональних даних Відвідувача Сайту
                    <ol>
                        <li>
                            Компанія збирає і обробляє персональні дані Відвідувача
                            виключно з метою, для якої вони збиралися/надавалися, в тому
                            числі:
                            <ol>
                                <li>
                                    надання Відвідувачу Сайту можливості входу на Сайт і
                                    доступу до ресурсів Сайту;
                                </li>
                                <li>
                                    організації та проведення Конкурсу;
                                </li>
                                <li>
                                    отримання Відвідувачем Сайту, який є учасником Конкурсу,
                                    (далі – «Учасник») призу в разі його присудження;
                                </li>
                                <li>
                                    розгляд питання про укладення трудового або
                                    цивільно-правового договору з Відвідувачем Сайту;
                                </li>
                                <li>
                                    встановлення зворотного зв'язку з Відвідувачем Сайту (в
                                    тому числі направлення Відвідувачу Сайту листів) для
                                    зазначених вище цілей (в тому числі уточнення персональних
                                    даних Відвідувача Сайту і направлення йому пропозицій про
                                    укладення трудового або цивільно-правового договору,
                                    розсилок, особиста комунікація з боку Компанії) і
                                    повідомлення Відвідувача Сайту про внесені зміни в цю
                                    Політику щодо цілей обробки, складу оброблюваних
                                    персональних даних і третіх осіб, яким вони можуть
                                    передаватися / бути доступні, або про внесені зміни в
                                    Правила конкурсу;
                                </li>
                                <li>
                                    рекламна/маркетингова мета, включаючи проведення промоції
                                    Конкурсу, направлення Відвідувачу Сайту новин про заходи, що
                                    проводяться Компанією, і запрошень на такі заходи,
                                    таргетованої реклами в пошукових мережах і соціальних
                                    мережах;
                                </li>
                                <li>
                                    занесення персональних даних Відвідувача Сайту в
                                    інформаційні системи персональних даних Компанії для
                                    формування кадрового резерву або бази потенційних
                                    контрагентів в рамках групи компаній ____ з метою розгляду
                                    питання про укладення трудового або цивільно-правового
                                    договору між Відвідувачем Сайту і юридичною особою з групи
                                    компаній ____;
                                </li>
                                <li>
                                    здійснення взаємодії (обмін інформацією) між Сайтом і
                                    ресурсом telescope.epam.com, який проводить аналіз і
                                    угруповання даних для Компанії;
                                </li>
                                <li>
                                    уточнення, підтвердження достовірності та повноти
                                    персональних даних, наданих Відвідувачем Сайту;
                                </li>
                                <li>
                                    виконання повноважень та обов'язків, покладених на
                                    Компанію чинним законодавством;
                                </li>
                                <li>
                                    файли «cookies» обробляються з метою, зазначеної в розділі
                                    6 цієї Політики;
                                </li>
                                <li>
                                    для іншої мети за згодою Відвідувача Сайту.
                                </li>
                            </ol>
                        </li>
                    </ol>
                </li>
                <li className='subTitle' id='details3'>
                    Правові підстави обробки персональних даних
                    <ol>
                        <li>
                            Правовими підставами обробки персональних даних
                            Компанією є:
                            <ol>
                                <li>
                                    згода суб'єкта персональних даних на обробку його
                                    персональних даних. Згода може бути отримана в будь-якій
                                    формі, що дозволяє підтвердити факт її отримання. При
                                    реєстрації на Сайті і надання своїх персональних даних
                                    шляхом заповнення полів анкети Відвідувач дає свою згоду на
                                    обробку персональних даних шляхом проставлення відмітки
                                    («галочки») в поле «Я згоден (на) на обробку моїх
                                    персональних даних»;
                                </li>
                                <li>
                                    необхідність виконання Компанією обов'язку володільця
                                    персональних даних, який передбачений законодавством;
                                </li>
                                <li>
                                    інші законні підстави для обробки персональних даних
                                    відповідно до чинного законодавства.
                                </li>
                            </ol>
                        </li>
                    </ol>
                </li>
                <li className='subTitle' id='details4'>
                    Обсяг і категорії оброблюваних персональних даних, категорії
                    суб'єктів персональних даних
                    <ol>
                        <li>
                            Компанія виробляє обробку персональних даних Відвідувачів
                            Сайту, зазначені Відвідувачами Сайту та/або зібраних автоматично
                            при реєстрації на Сайті (створенні облікового запису), включаючи
                            нікнейм (прізвище, ім'я), адреса електронної пошти, аватар
                            (фотографію), а також персональні дані з профілю Відвідувача в
                            соціальної мережі/у ресурсу в мережі «Інтернет» (Facebook,
                            LinkedIn, Twitter, аккаунт Google, GitHub тощо), з використанням
                            якої / -ого Відвідувачем здійснюється вхід на Сайт, в тому числі
                            нікнейм (прізвище, ім'я), аватар (фотографія) Відвідувача,
                            адреса електронної пошти з соціальної мережі/ ресурсу в мережі
                            «Інтернет», мережевий ідентифікатор (ID) профілю Відвідувача в
                            соціальній мережі/ ресурсі в мережі «Інтернет», мережевий
                            ідентифікатор (ID) Відвідувача на Сайте та інші надані
                            ідентифікатори (ID), автоматично визначуване на підставі
                            використовуваного IP-адреси місце знаходження (країна)
                            Відвідувача, а також персональні дані, зазначені Відвідувачем у
                            створюваному їм на Сайті профілі або іншим чином переданих їм
                            Компанії, включаючи громадянство (в разі зазначення), прізвище,
                            ім'я, по батькові, контактний телефон, відомості про освіту
                            (найменування навчального закладу, напрямок/спеціальність, курс,
                            форма навчання, отримана кваліфікація), відомості про наявний
                            досвід роботи/діяльності, в тому числі щодо займаних посад,
                            виконуваних робіт, надаваних послуг, наявних уміннях і навичках
                            (включаючи технології програмування, мови програмування і т.д.),
                            рівень володіння іноземними мовами, бажаний вид і характер
                            співпраці з Компанією або юридичними особами групи компаній ____
                            (в тому числі передбачувані види діяльності, виконувані роботи,
                            надані послуги в рамках планованих до укладання
                            цивільно-правових договорів, строки і порядок виконання робіт,
                            надання послуг, розмір винагороди і т. д.), бажаний час для
                            зворотного зв'язку з Відвідувачем, посилання на акаунти в
                            соціальних мережах, відомості з супровідного листа, дані
                            паспорту громадянина України та реєстраційний номер облікової
                            картки платника податків з Державного реєстру фізичних
                            осіб-платників податків (включаючи їх копії), зображення
                            Учасника у вигляді фотографій чи аудіо-, відеозаписів, інтерв'ю,
                            інші відомості, зібрані в автоматичному режимі (IP-адреси
                            пристроїв, з допомогою яких відвідується Сайт, тип пристрою,
                            дата і час відвідування Сайту, поновлення та видалення або
                            знищення даних, відомості про дії на Сайті, файли «cookies»), в
                            т.ч. з використанням метричних програм (систем) Яндекс.Метрика,
                            Google Analytics, Google Tag Manager, Google reCAPTCHA, J2SE/J2EE
                            фреймворків.
                        </li>
                    </ol>
                </li>
                <li className='subTitle' id='details5'>
                    Порядок та умови обробки персональних даних
                    <ol>
                        <li>
                            Обробка персональних даних здійснюється на основі наступних
                            принципів:
                            <ol>
                                <li>
                                    мета обробки персональних даних повинна бути чіткою і
                                    законною, а також повинна бути визначена до початку їх
                                    збору;
                                </li>
                                <li>
                                    обробка персональних даних здійснюється володільцем
                                    персональних даних лише за згодою суб'єкта персональних
                                    даних, за винятком тих випадків, коли така згода не
                                    вимагається чинним законодавством;
                                </li>
                                <li>
                                    згода суб'єкта на обробку його персональних даних повинна
                                    бути добровільною та інформованою. Згода може надаватися
                                    суб'єктом у письмовій або електронній формі, що дає змогу
                                    зробити висновок про її надання;
                                </li>
                                <li>
                                    обробка персональних даних здійснюється відкрито і прозоро
                                    із застосуванням засобів та у спосіб, що відповідають
                                    визначеним цілям такої обробки;
                                </li>
                                <li>
                                    у разі зміни визначеної мети обробки персональних даних на
                                    нову мету, яка є несумісною з попередньою, для подальшої
                                    обробки даних володілець персональних даних повинен отримати
                                    згоду суб'єкта персональних даних на обробку його даних
                                    відповідно до зміненої мети, якщо інше не передбачено чинним
                                    законодавством;
                                </li>
                                <li>
                                    персональні дані мають бути точними, достовірними та
                                    оновлюватися в міру потреби, визначеної метою їх обробки;
                                </li>
                                <li>
                                    склад та зміст персональних даних мають бути відповідними,
                                    адекватними та ненадмірними стосовно визначеної мети їх
                                    обробки;
                                </li>
                                <li>
                                    обробка персональних даних здійснюється для конкретних і
                                    законних цілей, визначених за згодою суб'єкта персональних
                                    даних, або у випадках, передбачених чинним законодавством, у
                                    порядку, встановленому законодавством;
                                </li>
                                <li>
                                    не допускається обробка даних про фізичну особу, які є
                                    конфіденційною інформацією, без її згоди, крім випадків,
                                    визначених чинним законодавством, і лише в інтересах
                                    національної безпеки, економічного добробуту та прав людини;
                                </li>
                                <li>
                                    персональні дані обробляються у формі, що допускає
                                    ідентифікацію фізичної особи, якої вони стосуються, не
                                    довше, ніж це необхідно для законних цілей, у яких вони
                                    збиралися або надалі оброблялися. Подальша обробка
                                    персональних даних в історичних, статистичних чи наукових
                                    цілях може здійснюватися за умови забезпечення їх належного
                                    захисту.
                                </li>
                            </ol>
                        </li>
                        <li>
                            Обробка персональних даних Відвідувача Сайту здійснюється
                            протягом строку обробки, зазначеного в згоді суб'єкта
                            персональних даних, до моменту відкликання такої згоди, якщо
                            немає інших законних підстав для обробки персональних даних
                            Відвідувачів Сайту. Обробка персональних даних може
                            здійснюватися будь-яким законним способом, в тому числі в
                            інформаційних системах персональних даних з використанням
                            засобів автоматизації або без використання таких засобів.
                        </li>
                        <li>
                            Компанія зобов'язується не розкривати третім особам і не
                            поширювати персональні дані без згоди суб'єкта персональних
                            даних, якщо інше не передбачено законодавством, за винятком
                            передачі персональних даних Відвідувача Сайту (надання доступу
                            до персональних даних) уповноваженим особам (працівникам та
                            представникам) Компанії та юридичних осіб з групи компаній ____,
                            іншим особам, зазначеним у цій Політиці та згоді на обробку
                            персональних даних, наданої Відвідувачем Сайту.
                        </li>
                        <li>
                            Компанія зобов'язується зробити розумні зусилля з належного
                            захисту персональних даних при їх обробці. Компанія застосовує
                            правові, організаційні та технічні заходи, спрямовані на
                            запобігання їх випадковим втратам або знищенню, незаконній
                            обробці, у тому числі незаконному знищенню чи доступу до
                            персональних даних, в тому числі:
                            <ol>
                                <li>
                                    запобігання впровадження в інформаційні системи, що обробляють
                                    персональні дані, шкідливих програм і програмних закладок;
                                </li>
                                <li>
                                    виявлення вторгнень в інформаційні системи, які обробляють
                                    персональні дані, що порушують або створюють передумови до
                                    порушення встановлених вимог щодо забезпечення безпеки
                                    персональних даних;
                                </li>
                                <li>
                                    аналіз захищеності інформаційних систем персональних даних.
                                </li>
                            </ol>
                        </li>
                        <li>
                            Доступ до персональних даних Відвідувачів Сайту надається
                            тільки уповноваженим особам (працівникам та представникам)
                            Компанії та юридичних осіб групи компаній ____, іншим особам,
                            зазначеним у цій Політиці та згоді на обробку персональних
                            даних, наданої Відвідувачем Сайту.
                        </li>
                        <li>
                            Внутрішній контроль за відповідністю обробки персональних
                            даних законодавству та прийнятим відповідно до них
                            нормативно-правовими актами здійснюється в порядку,
                            встановленому чинним законодавством.
                        </li>
                        <li>
                            Компанія веде облік операцій, пов'язаних з обробкою
                            персональних даних Відвідувачів Сайту та доступом до них. З цією
                            метою Компанією зберігається інформація про:
                            <ol>
                                <li>
                                    дату, час та джерело збирання персональних даних Відвідувачів
                                    Сайту;
                                </li>
                                <li>
                                    зміну персональних даних Відвідувачів Сайту;
                                </li>
                                <li>
                                    перегляд персональних даних Відвідувачів Сайту;
                                </li>
                                <li>
                                    будь-яку передачу (копіювання) персональних даних Відвідувачів
                                    Сайту;
                                </li>
                                <li>
                                    дату та час видалення або знищення персональних даних
                                    Відвідувачів Сайту;
                                </li>
                                <li>
                                    особи, яка здійснила одну із указаних операцій;
                                </li>
                                <li>
                                    мету та підстави зміни, перегляду, передачі та видалення або
                                    знищення персональних даних Відвідувачів Сайту.
                                </li>
                            </ol>
                        </li>
                        <li>
                            Компанія самостійно визначає процедуру збереження інформації про
                            операції, пов'язані з обробкою персональних даних Відвідувачів
                            Сайту та доступом до них. Сайт автоматично фіксує вказану
                            інформацію. Ця інформація зберігається Компанією упродовж одного
                            року з моменту закінчення року, в якому було здійснено зазначені
                            операції, якщо інше не передбачено чинним законодавством.
                        </li>
                        <li>
                            Оскільки Компанія є юридичною особою, яка входить до
                            міжнародної групи компаній ____, а Сайт використовується всіма
                            юридичними особами з даної групи компаній, персональні дані
                            Відвідувача Сайту надаються і можуть бути доступні всім
                            юридичним особам, що входять в дану групу, і використовуватися
                            ними виключно з метою, зазначеної в цій Політиці та згоді на
                            обробку персональних даних, наданої Відвідувачем Сайту.
                        </li>
                    </ol>
                </li>
                <li className='subTitle' id='details6'>
                    Файли «cookies»
                    <ol>
                        <li>
                            З метою поліпшення роботи Сайту, підвищення зручності та
                            ефективності роботи Відвідувача з Сайтом, надання рішень та
                            послуг, які найбільш відповідають потребам Відвідувача Сайту,
                            визначення переваг Відвідувача, відображення рекламних оголошень
                            (поведінкової реклами), а також для забезпечення технічної
                            можливості функціонування Сайту Компанії необхідно зберігати і
                            накопичувати інформацію про те, як Відвідувач Сайту використовує
                            даний Сайт. Для цього використовуються невеликі за розміром
                            текстові файли, які називаються «cookies». «Cookies» містять
                            невеликі обсяги інформації і завантажуються на комп'ютер
                            Відвідувача Сайту або інший пристрій з сервера Сайту Компанії.
                            Більш детальну інформацію про «cookies» та принципи їх роботи
                            можна знайти на ресурсі&nbsp;
                            <a href={ 'http://www.aboutcookies.org/' }>
                                http://www.aboutcookies.org/
                            </a>.
                        </li>
                        <li>
                            Коли Відвідувач заходить на Сайт, Компанія використовує
                            декілька програм (систем), які можуть встановлювати файли
                            «cookies», теги, пікселі і аналогічні технології відстеження
                            (спільно іменовані файли «cookies») на пристрої Відвідувача
                            Сайту, в браузері або на веб-сторінці, що переглядається
                            Відвідувачем Сайту, з метою персоналізації налаштувань
                            (наприклад, мовні переваги) відвідувача Сайту, забезпечення
                            розуміння характеру використання, надання, поліпшення і захисту
                            Сайту.
                        </li>
                        <li>
                            Сайт використовує різні типи файлів «cookies» для різних
                            цілей, а саме:
                            <ol>
                                <li>
                                    Абсолютно необхідні файли «cookies»: дані файли «cookies»
                                    необхідні для того, щоб Відвідувач Сайту міг переміщатися по
                                    Сайту і використовувати його функції. Без таких файлів неможливо
                                    використовувати основний функціонал Сайту.
                                </li>
                                <li>
                                    Експлуатаційні файли «cookies»: дані файли «cookies»
                                    збирають інформацію про те, як Відвідувач Сайту використовує
                                    Сайт. Зібрана інформація включає, наприклад, використовувані
                                    браузери і операційні системи, доменне ім'я раніше відвіданого
                                    веб-сайту, кількість відвідувань, середню тривалість
                                    відвідування та переглянуті сторінки. Такі файли «cookies» не
                                    збирають інформацію, яка ідентифікує Відвідувача Сайту особисто,
                                    і укрупнені дані (дані, зібрані і виражені в узагальненому
                                    вигляді для цілей статистичного аналізу і не є персональними
                                    даними відповідно до чинного законодавства). Експлуатаційні
                                    файли «cookies» використовуються для підвищення зручності
                                    користування Сайтом і підвищення ступеня задоволеності
                                    Відвідувача Сайту роботою Сайту.
                                </li>
                                <li>
                                    Функціональні файли «cookies»: дані файли «cookies»
                                    дозволяють Сайту запам'ятовувати вибрані Відвідувачем Сайту
                                    варіанти (наприклад, ім'я Відвідувача Сайту або мережевий
                                    ідентифікатор (ID), мовні настройки або область або регіон, в
                                    якому знаходиться Відвідувач Сайту) і надають розширені, більш
                                    персоналізовані функції Сайту. Ці файли «cookies» також можна
                                    використовувати для запам'ятовування змін, внесених Відвідувачем
                                    Сайту в розмір тексту, шрифти та інші частини веб-сторінок, що
                                    настроюються. Інформацію, яку збирають такі файли «cookies»,
                                    можливо знеособити; дані файли «cookies» не можуть відстежувати
                                    активність Відвідувача Сайту на інших сайтах.
                                </li>
                            </ol>
                        </li>
                        <li>
                            Користуючись Сайтом, Відвідувач Сайту погоджується на те,
                            що Компанія може використовувати експлуатаційні і перенапраямні
                            файли «cookies» сторонніх сервісів, таких як метричні програми
                            (системи) Google Analytics, Яндекс.Метрика, Google Tag Manager,
                            Google reCAPTCHA, .NET фреймворку, IS3 компонента, провайдерів
                            авторизації LinkedIn, Facebook, аккаунта Google, Twitter, Github
                            і тощо. для збору інформації про онлайн-дії Відвідувача Сайту на
                            Сайті і інших сайтах групи компаній ____. Така інформація
                            використовується для відображення рекламних оголошень з
                            урахуванням інтересів Відвідувача Сайту (поведінкова реклама), а
                            також для збору інформації, яка допомагає відслідковувати і
                            керувати ефективністю рекламних оголошень і кількістю
                            відвідувачів. Це означає, що Компанія може показувати рекламні
                            оголошення виходячи з минулих відвідувань Сайту через видавничі
                            мережі, такі як Google Content Network (GCN). З додатковою
                            інформацією про такі файли «cookies» можна ознайомитися на
                            веб-сайті відповідної третьої сторони. Відвідувач Сайту також
                            може отримати більше інформації про певні рекламні оголошення
                            (поведінкова реклама) і відмову від них, відвідавши такі сайти:
                            Digital Advertising Alliance-US, Network Advertising Initiative,
                            Digital Advertising Alliance-Canada, European Interactive
                            Digital Advertising Alliance,
                            &nbsp;
                            <a href={ 'http://www.aboutcookies.org' }>
                                http://www.aboutcookies.org
                            </a>
                            ,
                            &nbsp;
                            <a href={ 'http://www.allaboutcookies.org' }>
                                http://www.allaboutcookies.org
                            </a>
                            &nbsp;
                            або налаштування пристрою Відвідувача
                            Сайту для мобільного застосування Сайту. Відвідувач Сайту також
                            може змінити налаштування реклами в мережі Google Display
                            Network або відмовитися від них за адресою:&nbsp;
                            <a href={ 'http://www.google.com/settings/ads/' }>
                                http://www.google.com/settings/ads/
                            </a>.
                        </li>
                        <li>
                            Якщо Відвідувач Сайту не згоден з деякими видами
                            використання файлів «cookies», описаними вище, Відвідувач Сайту
                            може скористатися налаштуваннями свого браузера або не
                            використовувати Сайт. Якщо Відвідувач Сайту вирішить відмовитися
                            від використання файлів «cookies» через настройки браузера,
                            Відвідувач Сайту все одно зможе використовувати Сайт, хоча
                            доступ Відвідувача Сайту до деяких функцій і веб-сторінок Сайту
                            може бути обмежений. Оскільки засоби, за допомогою яких
                            Відвідувач Сайту може відмовитися від збору Компанією файлів
                            «cookies» через елементи управління браузера, відрізняються в
                            залежності від браузера, для отримання додаткової інформації
                            Відвідувачу Сайту слід звернутися до меню довідки браузера,
                            використовуваного Відвідувачем Сайту.
                            <ol>
                                <li>
                                    Інформація про те, як змінювати налаштування файлів
                                    «cookies» в браузері Google Chrome, доступна на ресурсі:
                                    &nbsp;
                                    <a href={ 'https://support.google.com/chrome/answer/95647?hl=en' }>
                                        https://support.google.com/chrome/answer/95647?hl=en
                                    </a>

                                </li>
                                <li>
                                    Інформація про те, як змінювати налаштування файлів
                                    «cookies» в браузері Microsoft Internet Explorer, доступна на
                                    ресурсі:
                                    &nbsp;
                                    <a href={ 'https://support.microsoft.com/en-us/help/278835/how-to-delete-cookie-files-in-internet-explorer' }>
                                        https://support.microsoft.com/en-us/help/278835/how-to-delete-cookie-files-in-internet-explorer
                                    </a>
                                </li>
                                <li>
                                    Інформація про те, як змінювати налаштування файлів
                                    «cookies» в браузері Mozilla Firefox, доступна на ресурсі:
                                    &nbsp;
                                    <a href={ 'https://support.mozilla.org/en-US/kb/delete-cookies-remove-info-websites-stored' }>
                                        https://support.mozilla.org/en-US/kb/delete-cookies-remove-info-websites-stored
                                    </a>
                                </li>
                                <li>
                                    Інформація про те, як змінити налаштування «cookies» в
                                    браузері Apple Safari, доступна на ресурсі:
                                    &nbsp;
                                    <a href={ 'https://support.apple.com/guide/safari/manage-cookies-and-website-data-sfri11471/mac' }>
                                        https://support.apple.com/guide/safari/manage-cookies-and-website-data-sfri11471/mac
                                    </a>
                                </li>
                            </ol>
                        </li>
                        <li>
                            Відвідувач Сайту повинен враховувати, що в даний час Сайт
                            не налаштований для обробки сигналів браузера «Не відстежувати».
                        </li>
                        <li>
                            Щоб звернутися до Компанії з приводу використання файлів
                            «cookies», Відвідувач Сайту може відправити повідомлення по
                            електронній пошті
                            &nbsp;
                            <a href={ ' mailto: ' + orgEmail }>{ orgEmail }</a>.
                        </li>
                        <li>
                            Кнопки доступу до соціальних мереж/ресурсів в мережі
                            «Інтернет», що розміщені на Сайті, використовуються для того,
                            щоб Відвідувачі Сайту могли увійти на Сайт через такі соціальні
                            мережі/ресурси або поділитися посиланням на веб-сторінку або
                            зробити електронну закладку. Дані кнопки є посиланнями на
                            веб-сайти соціальних мереж, що належать третім особам, які, в
                            свою чергу, можуть фіксувати інформацію про активність
                            Відвідувачів в мережі «Інтернет», в тому числі на даному
                            веб-сайті. Відвідувачам рекомендується ознайомитися з
                            відповідними умовами використання та політикою конфіденційності
                            таких сайтів для розуміння того, як вони використовують
                            персональні і інші дані Відвідувачів, і того, як можна
                            відмовитися від використання ними персональних та інших даних
                            Відвідувачів або видалити їх. Компанія не несе відповідальності
                            за правила або політику обробки даних і захисту інформації,
                            прийняті на цих ресурсах.
                        </li>
                        <li>
                            На даному Сайті можуть бути використані сторонні
                            веб-сервіси для відображення тих чи інших елементів, наприклад,
                            для відображення зображень, перегляду відео або організації
                            голосувань / опитувань. Так само, як і в випадку з кнопками
                            доступу до соціальних мереж (пукнті 6.8 цієї Політики), Компанія не
                            може перешкоджати збору цими сайтами або зовнішніми доменами
                            інформації про те, як Відвідувачі використовують зміст Сайту.
                            Сайт також може містити посилання на інші веб-сайти, які
                            підтримуються третіми особами. Компанія не несе відповідальності
                            за правила або політику захисту інформації, прийняті на цих
                            ресурсах. Відвідувачам рекомендується ознайомитися з політикою
                            захисту інформації кожного відвідуваного ними веб-сайту.
                        </li>
                        <li>
                            На власний розсуд Компанія може періодично вносити зміни
                            або доповнення в ці умови використання файлів «cookies».
                            Компанія закликає Відвідувачів періодично перечитувати цю
                            Політику для ознайомлення зі способами використання файлів
                            «cookies».
                        </li>
                    </ol>
                </li>
                <li className='subTitle' id='details7'>
                    Зміна, видалення та знищення персональних даних, порядок
                    доступу до персональних даних, відкликання згоди на обробку
                    персональних даних
                    <ol>
                        <li>
                            Відвідувач Сайту має право пред'являти вмотивовану вимогу
                            щодо заборони обробки своїх персональних даних (їх частини),
                            зміни або знищення своїх персональних даних Компанією, якщо ці
                            дані обробляються незаконно чи є недостовірними. Така вимога
                            розглядається Компанією впродовж 10 (десяти) днів з моменту
                            отримання. Компанія зобов'язана вносити зміни до персональних
                            даних на підставі вмотивованої письмової вимоги Відвідувача
                            Сайту, а також за зверненням інших суб'єктів відносин,
                            пов'язаних із персональними даними, якщо на це є згода
                            Відвідувача Сайту чи відповідна зміна здійснюється згідно з
                            приписом уповноваженого органу / посадової особи, чи за рішенням
                            суду, що набрало законної сили. Зміна персональних даних, які не
                            відповідають дійсності, проводиться невідкладно з моменту
                            встановлення невідповідності, а обробка недостовірних або
                            незаконно оброблюваних персональних даних повинна бути
                            припинена, про що Компанія інформує Відвідувача Сайту. У разі
                            якщо вимога не підлягає задоволенню, Відвідувачу Сайту надається
                            мотивована відповідь щодо відсутності підстав для її
                            задоволення.
                        </li>
                        <li>
                            Персональні дані видаляються або знищуються в порядку,
                            встановленому відповідно до вимог чинного законодавства. При
                            досягненні цілей збору та обробки персональних даних, а також в
                            разі відкликання Відвідувачем Сайту згоди на їх обробку
                            персональні дані підлягають знищенню, якщо:
                            <ol>
                                <li>
                                    Компанія не має права здійснювати обробку без згоди суб'єкта
                                    персональних даних на підставах, передбачених чинним
                                    законодавством;
                                </li>
                                <li>
                                    інше не передбачено в згоді суб'єкта персональних даних, іншої
                                    угоді між Компанією і суб'єктом персональних даних.
                                </li>
                            </ol>
                        </li>
                        <li>
                            Компанія повідомляє Відвідувача Сайту про склад і зміст
                            зібраних персональних даних, його права, визначені чинним
                            законодавством, мету збору персональних даних та третіх осіб,
                            яким передаються його персональні дані, в момент збору
                            персональних даних на Сайті. Про зміну, видалення чи знищення
                            персональних даних або обмеження доступу до них Компанія
                            протягом 10 (десяти) робочих днів повідомляє Відвідувача Сайту,
                            а також суб'єктів відносин, пов'язаних із персональними даними,
                            яким ці дані було передано.
                        </li>
                        <li>
                            Відвідувач Сайту має право на одержання будь-яких
                            відомостей про себе за запитом, що направляється рекомендованим
                            листом або передається особисто за адресою: Україна, г. Київ,
                            вул. ____________ __, ______, із зазначенням наступної інформації
                            щодо себе: прізвище, ім'я та по батькові, місце проживання
                            (місце перебування) і реквізити документа, що посвідчує фізичну
                            особу, яка подає запит. Відстрочення доступу Відвідувача Сайту
                            до своїх персональних даних не допускається.
                        </li>
                        <li>
                            Відвідувач Сайту має право в будь-який час відкликати згоду
                            на обробку його персональних даних шляхом письмового
                            повідомлення про відкликання, надісланого рекомендованим листом
                            або переданого особисто Відвідувачем Сайту за адресою: Україна,
                            г. Київ, вул. ____________ __, ______ або за адресою електронної пошти:
                            &nbsp;
                            <a href={ ' mailto: ' + orgEmail }>{ orgEmail }</a>.
                            Відкликання згоди на обробку
                            персональних даних Учасником унеможливлює подальшу участь такого
                            Учасника у Конкурсі.
                        </li>
                    </ol>
                </li>
                <li className='subTitle' id='details8'>
                    Прикінцеві положення
                    <ol>
                        <li>
                            Компанія має право вносити зміни і доповнення в цю
                            Політику, в разі необхідності, а також у разі внесення
                            відповідних змін до чинного законодавства.
                        </li>
                        <li>
                            При внесенні змін в актуальній редакції Політики вказується
                            дата останнього оновлення. Нова редакція Політики набирає
                            чинності з моменту її розміщення на Сайті, якщо інше не
                            передбачено новою редакцією Політики. Продовжуючи користуватися
                            Сайтом Відвідувач Сайту підтверджує згоду з внесеними змінами і
                            доповненнями в Політику.
                        </li>
                        <li>
                            Чинна редакція Політики постійно доступна на сторінці Сайту за
                            посиланням: <a href={ privacyPolicyUrl }>
                                { privacyPolicyUrl }<img src={ Icon } alt='Політика Конкурсу' />
                            </a>
                        </li>
                    </ol>
                </li>
            </ol>
        </div>
    </div>
);

export default PrivacyPolicyContainer;
